[
    {
        "scene": "SHERLOCK SERIES 2\nEpisode 2 -\n\"A Scandal In Belgravia\"\nWritten by Steven Moffat\nFinal shooting script -\n25.07.2011\n© 2021 HARTSWOOD FILMS LIMITED. ALL RIGHTS RESERVED.\nTHE SCREENPLAY IS THE PROPERTY OF HARTSWOOD FILMS LIMITED (\"PRODUCER\"). DISTRIBUTION OR DISCLOSURE\nOF ANY INFORMATION OF WHATEVER NATURE IN WHATEVER FORM RELATING TO THE CHARACTERS, STORY AND\nSCREENPLAY ITSELF OBTAINED FROM ANY  SOURCE INCLUDING WITHOUT LIMITATION THIS SCREENPLAY OR\nINFORMATION RECEIVED FROM PRODUCER, TO UNAUTHORIZED PERSONS, OR THE SALE, COPYING OR REPRODUCTION\nOF THIS SCREENPLAY IS STRICTLY PROHIBITED. THIS SCREENPLAY CONTAINS INFORMATION AND THEREFORE\nIS GIVEN FOR REVIEW ON A STRICTLY CONFIDENTIAL BASIS. BY READING THIS SCREENPLAY YOU AGREE TO BE\n\n\nINT. SWIMMING POOL - NIGHT\n1\n1\n... recap ...\n... into the scene now.\n... JOHN, noticing the red dots suddenly buzzing on his\nshirt, SHERLOCK, the same ...\nNow JIM MORIARTY striding back into the room.\nJIM\nSorry, boys, I’m so changeable. It\nis a weakness with me, but to be\nfair to myself, it is my only\nweakness. You can’t be allowed to\ncontinue. You just can’t. I would\ntry to convince you, but everything\nI have to say has already to say\nhas already crossed your mind.\nSherlock and John - a glance. A nod from John. And Sherlock\nturns, levels his gun at Jim.\nSHERLOCK\nThen possibly my answer has crossed\nyours.\nAnd now lowers the gun -\n- to point at the piles of explosives.\nAnd we build to the cliffhanger, just as before, the music\nbuilding and building, and then ...\nThe BeeGees! From somewhere, Staying Alive is playing.\nJohn and Sherlock: a world of what??\nBut Jim just smirks.\nHe pats his jacket pocket - his phone, we’re hearing the\nringtone.\nJIM\nMind if I get that?\nSHERLOCK\nYou have the rest of your life.\nJim grins, pulls out the phone.\nJIM\nHello?\n(Listens, impatient)\nYes, of course it is, what do you\nwant?\nHe rolls his eyes at Sherlock - honestly, some people! But\nnow his face is changing at what he’s hearing. Now, he’s\ninterested - alert and cold and fierce.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n1.\n\n\nJIM\nSay that again. Say it again, and\nunderstand that if you are lying to\nme, I will find you and I will skin\nyou!\nJohn and Sherlock exchanging a look - what the hell ... ?\nJim, listening, deciding.\nJIM\nYes. Yes, of course I am. Wait!\nHe looks up at his unseen gunmen above, makes a motion - get\nout!\nOn John and Sherlock -\n- and all the little red dots are disappearing. From off we\ncan hear feet footfalls, doors banging, people leaving.\nOn John, looking up, listening. Are they actually going to\nsurvive.\nOn Sherlock: doesn’t take his eyes off Jim, doesn’t lower his\ngun.\nNow Jim is stepping forward to Sherlock.\nJIM\nSorry, my dear. Wrong day to die.\nSHERLOCK\n(Looking to the phone)\nDid somebody make you a better\noffer.\nJIM\nOh, don’t you worry, we’ll find the\nright moment. Because we’ve got a\nproblem to solve together, you and\nI. Do you know what it is?\nSHERLOCK\nI’m fascinated.\nJIM\nThe big one. The best one. The\nfinal problem. And the funny thing\nis, I’ve already told you all about\nit. You’ll be hearing from me,\nSherlock - but not for a while.\nAnd he turns on his heel and just walks away. Talking on his\nphone.\nJIM\nIf you have what you say you have,\nI will make you rich. If you don’t,\nI will make you into shoes...\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n2.\n\n\nHe’s gone. A moment on Sherlock and John. Sherlock finally\nlowers the gun.\nThey look at each other.\nJOHN\nWhat was that?\nSHERLOCK\nWho was that?\nINT. HOTEL SUITE - NIGHT\n2\n2\nA woman’s hand, red-fingernailed, is hanging up a phone -\n- then reaches for a riding crop lying next to it. As she\nheads away, we pan up -\n- to see a woman dressed in tight fitting leather. She’s\nheading away from us, through an opulent hotel suite. She\ncarries the riding crop lightly in one hand.\nAnd now she disappears through the open door of what is a\nclearly a bedroom.\nFrom off, we hear her voice.\nIRENE ADLER\n(From off)\nWell now. Have you been wicked,\nyour highness?\nAnd then, in reply, another female voice.\nFEMALE VOICE\n(From off)\nYes, Miss Adler.\nSwish, crack, and on this we\nTHE OPENING TITLES\n3\n3\n"
    },
    {
        "scene": "EXT. BAKER STREET - MORNING4\n4\nEstablisher of the flat, closing in on ...\n221b. Over this, we hear typing. The plastic rattle of a\ncomputer keyboard.\nINT. 221B BAKER STREET - MORNING\n5\n5\nSHERLOCK and JOHN in their accustomed position across the\ntable from each other. Breakfast, coffee - Sherlock scanning\nand discarding the papers, John typing away on his computer.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n3.\n\n\nSHERLOCK\nWhat are you typing?\nJOHN\nBlog.\nSHERLOCK\nAbout?\nJOHN\nUs.\nSHERLOCK\nYou mean me.\nJOHN\nWhy?\nSHERLOCK\nWell you’re typing a lot.\nJohn gives him a look - the ego of the man! But Sherlock is\nalready throwing aside his paper, springing up ready for\naction.\nSHERLOCK\nRight then! So what have we got?\n(The following sequence is a sort of montage - a few months a\nin the life of John and Sherlock at the top of their game.\nFast, fluid, music-driven.)\nINT. 221B BAKER STREET - DAY\n6\n6\nA TIMID MAN sitting in the client chair, in 221b. (We haven’t\nnominated one, but let’s do it - should be facing the boys\narmchairs.)\nTIMID MAN\nMy wife seems to be spending a very\nlong time at the office -\nSHERLOCK\n(From off)\nBoring!\nCUT TO:\nSame shot, same chair a WOMAN\nWOMAN\nI think my husband might be having\nan affair -\nSHERLOCK\n(From off)\nYes!\nCUT TO:\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n4.\n\n\nSame shot, same chair, a big beefy creepy guy.\nCREEPY GUY\nShe’s not my real Aunt, she’s been\nreplaced, I know she has.\n(Holds up an urn)\nI know human ash!\nSHERLOCK\nLeave!\nWHIP PAN TO:\nA MARRIED COUPLE this time. He stands in front of the\nfireplace, addressing Sherlock and John - pompous, full of\nhimself - and she hovers timidly at his shoulder. Sherlock is\npacing boredly.\nHUSBAND\n... no one should have been able to\nempty that bank account, other than\nmyself and my wife.\nSHERLOCK\nThen why didn’t you assume it was\nyour wife?\nHUSBAND\nBecause I have always had total\nfaith -\nSHERLOCK\nNo, because you knew you emptied it\nyourself.\n(Prods the man’s\nwaistband, hair, face in\nrapid successions)\nWeight-loss! Hair dye! Botox!\nAffair!\n(Hands a card to the wife)\nLawyer!\nWHIP PAN TO:\nBack to the client chair. An important looking man, in a\nbusiness suit - flanked by two other men in suits.\nBUSINESS MAN\n... we are prepared to offer any\nsum of money you care to name, for\nthe recovery of these files -\nSherlock walks across the frame -\nSHERLOCK\nBoring!\nThe frame wipes with Sherlock’s cross and becomes:\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n5.\n\n\nA nervy, geeky young man in a sci-fi tee-shirt. He is flanked\nby two other geeky teenagers, standing just behind him.\n(Positions exactly resembling the business men.)\nGEEKY YOUNG MAN\nWe have this website - it explains\nthe true meaning of comic books,\ncos people miss a lot of the themes\n- but then all the comic books\nstarted coming true.\nSHERLOCK\n(From off)\nOh, interesting.\nWHIP PAN TO:\nJohn typing away at his computer, Sherlock looking grumpily\nover his shoulder.\nSHERLOCK\nThe Geek Interpreter. What’s that?\nJOHN\nThe title.\nSHERLOCK\nWhat does it need a title for?\nWHIP PAN TO:\nINT. BARTS CORRIDOR - DAY\n7\n7\nSHERLOCK and JOHN heading along the corridor towards us,\nSALLY DONOVAN leading the way.\nA YOUNG OFFICER passes in the opposite direction.\nYOUNG OFFICER\n(To John)\nLoved The Geek Interpreter.\nSALLY DONONVAN\nYeah, that was good one.\nINT. MORGUE - DAY\n8\n8\nOn a blonde woman, lying dead. Her face is covered in\nblotches and spots. SHERLOCK and JOHN doing their\nexamination. LESTRADE stands a few feet away, waiting for\nthem to be done.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n6.\n\n\nSHERLOCK\nSo people actually read that blog.\nJOHN\nWhere do you think our clients come\nfrom?\nSHERLOCK\nI have a website ...\nJOHN\nWhere you enumerate 240 different\ntypes of tobacco ash - nobody’s\nreading your website.\n(Of the corpse)\nOkay, mid-thirties, reasonable\ncondition, dyed blonde hair, no\nobvious cause of death - except\nthese speckles, whatever they are.\nWHIP PAN TO:\nINT. 221B BAKER STREET - DAY\n9\n9\nAgain, John typing away, Sherlock reading grumpily over his\nshoulder.\nSHERLOCK\nOh for God’s sake!\nJOHN\nWhat?\nSHERLOCK\nThe Speckled Blonde!\nWHIP PAN TO:\nINT. 221B BAKER STREET - NIGHT\n9C\n9C\nTwo little girls squeezed together on the client chair.\nLITTLE GIRL\nThey wouldn’t let us see Grandad\nwhen he was dead. Is that cos he’d\ngone to heaven?\nSHERLOCK\n(From off)\nPeople don’t really go to heaven -\nthey’re taken to a special room and\nburned --\nJOHN\nSherlock!\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n7.\n\n\nINT. BACK STREET - DAY\n9A\n9A\nAnother day, another crime scene. LESTRADE leading JOHN and\nSHERLOCK along a back alley - at the end there’s a crashed\ncar, with the boot open, and a dead man’s arm hanging out.\nLESTRADE\nThere was a plane crash near\nDusseldorf yesterday, everyone\ndead.\nSHERLOCK\nSuspected terrorist bomb, we do\nwatch the news.\nJOHN\nYou said boring and turned over.\nLestrade now standing over the body in the boot.\nLESTRADE\nAccording to the flight details,\nthis man was checked in on board.\nInside his coat ...\n(Holding up clear plastic\nevidence bags)\n... stub of his boarding pass,\nnapkins from the flight, even one\nof their special biscuits. Here’s\nhis passport stamped in Berlin\nairport. This man should have died\nin a plane crash in Germany\nyesterday. But instead he’s dead in\na car boot in Southwark.\nJOHN\nLucky escape.\nLESTRADE\nAny ideas?\nSHERLOCK\nEight so far.\nJUMP CUT TO:\nSherlock examining the body - frowning, as he works.\nSHERLOCK\nOkay four ideas.\nJUMP CUT TO:\nSherlock examining the boarding pass. Frown’s getting worse.\nSHERLOCK\nMaybe two ideas.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n8.\n\n\nINT. 221B BAKER STREET - DAY\n9B\n9B\nSHERLOCK looking over JOHN’s shoulder at the blog again.\nSHERLOCK\nDon’t mention the unsolved ones!\nJOHN\nPeople want to know you’re human.\nSHERLOCK\nWhy?\nJOHN\nBecause they’re interested.\nSHERLOCK\nNo they aren’t. Why are they?\nHe storms off to his own side of the desk - but John has had\nenough. Taps his computer screen.\nJOHN\nOne thousand, eight-hundred and\nninety five.\nSHERLOCK\nSorry, what?\nJOHN\nI reset the counter last night.\nThis blog had nearly two-thousand\nhits in the last eight hours. This\nis your living, Sherlock - not 240\ndifferent types of tobacco ash!\nSHERLOCK\n... 243.\nJohn, back to his typing. We pan up his screen to the hit\ncounter - 1895.\nWHIP PAN TO:\nINT. THEATRE BACK STAGE - NIGHT\n10\n10\nSHERLOCK and JOHN heading along a back stage corridor -\nUNIFORMED POLICE are dashing in the opposite direction, and\nour heroes are heading home.\nSHERLOCK\nSo what’s this one? The Bellybutton\nMurders?\nJOHN\nThe Navel Treatment?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n9.\n\n\nSHERLOCK\nEww.\nThey are heading down a flight of steps to:\nCUT TO:\nINT. STAGE DOOR - NIGHT\n11\n11\n- SHERLOCK and JOHN emerging into the stage door area. More\nPOLICEMEN, and LESTRADE. (There’s a COAT RACK here, a row of\ncoats.)\nLESTRADE\nGuys, there’s a lot of press\noutside.\nSHERLOCK\n(Heading to the doors)\nWell they won’t be interested in\nus.\nLESTRADE\nYeah, that was before you were an\ninternet phenomenon. Couple\nof them specifically wanted\nphotographs of you two.\nSHERLOCK\nOh, for God’s sake.\nSherlock has gone to the coat rack, taken a couple of hats -\nthe only two ones there - and now tosses one to John.\nSHERLOCK\nCover your face, John, we’ll move\nfast.\nJohn is pulling a cap down over his face..\nLESTRADE\nStill, good for the public image,\nbig case like this.\nSHERLOCK\nI’m a private detective. The last\nthing I need is a public image.\nAs he says this, he jams a hat on this heat - and fatefully,\nit happens to be a deerstalker. He pulls it down over his\nface, and starts pushing through the doors -\n- into an explosion of flashbulbs. And the first flash\nbecomes -\n- a newspaper photograph!\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n10.\n\n\nA black a white of deerstalker-ed Sherlock and John heading\nout the doors. Pulling out to the headline (NOT front page)\nHAT-MAN AND ROBIN, THE WEB DETECTIVES.\nNow a series of flashes and we see variants of the same image\nfrom various angles in various pages, always centred on the\ndeerstalker. Various headlines. SHERLOCK HOLMES - NET\nPHENOMENON. SHERLOCK - NET ‘TEC. SHERLOCK AND JOHN - BLOGGER\nDETECTIVES.\nOn the final flash the last one becomes -\nINT. IRENE’S LIVING ROOM - DAY\n12\n12\n- an actual newspaper lying on a table. We hold on a moment -\n- then a hand reaches into shot, a red fingernail traces\nSherlock’s cheekbone for a moment.  During this, from off, we\nhear the beeps of someone punching a number into a phone. The\nphone is now being answered and the hand withdraws.\nIRENE ADLER\n(From off)\nHello. I think it’s time - don’t\nyou?\nAnd then something is tossed casually on to the paper - a\nriding crop, lying right across Sherlock’s face ...\nWe fade to black ...\n"
    },
    {
        "scene": "EXT. BAKER STREET - EARLY MORNING13\n13\nEstablisher of the flat. A beautiful, sunny day. Early\nmorning sunshine.\nINT. 221B BAKER STREET - EARLY MORNING\n14\n14\nMorning light blazing over the deserted sitting room -\npanning over details ...\n... last night’s pizza boxes, coffee cups, a cluedo board\nskewered to the wall with a knife ...\n... closing on the kitchen. MRS HUDSON has been trying to\ntidy up. She’s now kneeling at the freezer. She’s pulled out\na bag of something of something squelchy and unsavoury.\nShe peers at it.\nMRS HUDSON\nOh dear! Thumbs!\nA movement makes her look up. She startles.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n11.\n\n\nStanding in the living room, a MAN, portly, profoundly\nworried. He’s panting, like he’s been running. He looks\nfrightened, sweaty, at his wits end. This is PHIL.\nPHIL\nSorry, the door ... the door was\n...\nAs Mrs. Hudson stares at him, he sways on his feet  -\n- then crashes headlong to the floor in a dead faint.\nA moment, as Mrs Hudson stares at the prone figure. Then she\nturns and calls.\nMRS HUDSON\nBoys! You’ve got another one!\nINT. 221B BAKER STREET - DAY\n15\n15\nOn PHIL now, sitting in client chair (same framing as the\nothers) looking a bit lost and bewildered.\nSHERLOCK\n(From off)\nTell us from the start. Don’t be\nboring.\nAnd we track super-fast round Phil so that we’re looking at\nhim in profile and shot becomes -\n"
    },
    {
        "scene": "EXT. COUNTRY ROAD/PHIL’S CAR - DAY (LATE AFTERNOON)16\n16\n- PHIL sitting at the wheel of his car. The car stationary,\nand he’s trying to start it. The engine turns, coughs,\nsplutters.\nCAPTION\n10 HOURS PREVIOUSLY.\nHe’s now getting out of the car, go to the propped-open\nbonnet.\nHe’s parked at side of a country road. Fields fall away all\naround - magnificent desolation.\nOn Phil grimly contemplating the state of his engine. He\nglances around him. No one for miles ... except ...\nPhil’s POV. In the middle of the rolling fields, standing\nwith his back to us, is a solitary figure - a HIKER. He’s\nsome distance away, but we can see that he has a BACKPACK at\nhis feet and seems to have stopped a moment to admire the\nscenery. He stands a few feet from a stream, runs between the\nPhil and the Hiker.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n12.\n\n\nPhil heads back to the driving seat, tries the engine. This\ntime - bang! The car’s backfired. Phil sighs, starts to climb\nout again -\n- but stops at something he sees.\nPhil’s POV. The HIKER, is now lying flat on his back like\nhe’s fallen, or been struck down.\nPhil frowns - something about the way the man is lying.\nPHIL\n(Calling over)\nHey! You okay? Excuse me, are you\nall right?\nNo answer. Phil - curious, maybe a little chilled - starts\nheading over.\nClone on the HIKER. Lying flat on his back, staring\nsightlessly at the sky - a stain spreading on the grass\nbeneath him, as we dissolve to:\n"
    },
    {
        "scene": "EXT. COUNTRY ROAD - DAY16A\n16A\nThe same patch of grass a few hours later. The blood stain\nhas dried and the body has now been replaced by an outline.\nPulling further back, we see that a tent has been built round\nthis little area, and D.I. Carter is now ducking out of it.\nWider: uniformed POLICE searching in the grass for a murder\nweapon. PHIL’s car is still parked by the side of the road,\nwhere we last saw it and there are several police vehicles\nparked around the place.\nA YOUNG POLICEMAN is now calling out of a larger police van\nwhich is clearly the centre of operations.\nYOUNG POLICEMAN\n(Calling to Carter)\nSir! Phone call for you?\nINT. SCOTLAND YARD/ LESTRADE’S OFFICE - DAY\n22\n22\nLESTRADE. On his phone, talking. Wearied and business-like -\nas if he’s had to make calls like this a few times.\nLESTRADE\nHave you heard of Sherlock Holmes?\n"
    },
    {
        "scene": "EXT. COUNTRY ROAD - DAY23\n23\n(Intercut as required.)\nCARTER\nWho?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n13.\n\n\nThe SOUND OF A CAR drawing up. Carter glances round - a CAR\nis slowing to halt at the side of the road. The YOUNG\nPOLCEMAN is already heading over to talk to the driver.\nLESTRADE\nYou’re about to meet him. Now it’s\nyour case, it’s entirely up to you -\nthis is just friendly advice. Give\nSherlock five minutes on your crime\nscene, listen to everything he\nsays, and as far as possible, try\nnot to punch him\nCarter’s face: what??\n"
    },
    {
        "scene": "EXT. COUNTRY ROAD - DAY24\n24\nJOHN, now leaning against his parked car (the one we saw\narriving) holding a laptop. The YOUNG POLICEMAN who stopped\nhim turns as CARTER approaches.\nPOLICEMAN\nSir, this gentlemen says he needs\nto talk to you, he said -\nCARTER\nYeah, I know. Sherlock Holmes?\nJOHN\nJohn Watson. Are you set up for wi-\nfi?\n"
    },
    {
        "scene": "EXT. COUNTRY ROAD - DAY25\n25\nThe POLICE TEAM we saw earlier, now standing to one side of\nthe crime scene, like they’ve been cleared out of the way.\nThey’re watching something in bemusement.\nINT. 221B BAKER STREET - DAY\n27\n27\nOn Sherlock. He’s at the desk, wearing only a bedsheet,\nwrapped around him like he’s a Roman consul. Clearly he’s\njust got out of bed and not even bothered to get dressed.\nJOHN\n(From off)\nYou realise this is a tiny bit\nhumiliating?\nSHERLOCK\nOh, I’m fine. Take me to the\nstream.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n14.\n\n\n"
    },
    {
        "scene": "EXT. COUNTRY ROAD - DAY28\n28\nOn JOHN. He’s holding his LAPTOP open in front of him, screen\noutward. On the screen we can see Sherlock in his sheet, on\nthe sofa in Baker Street, peering at everything John shows\nhim as he’s now carries him over the to the stream. Skype\nDetective! Carter is walking a few paces behind, not quite\nbelieving his eyes.\nJOHN\nDidn’t really mean for you.\nINT. 221B BAKER STREET - DAY\n29\n29\nSherlock at the desk - we now see his laptop open in front of\nhim. On the screen we can see the POV of the webcam built\ninto John’s laptop.\nSHERLOCK\nThis is a six out of ten. There’s\nno point in me leaving the flat for\nanything less than a seven - we\nagreed. Now take me back, closer on\nthe grass.\n"
    },
    {
        "scene": "EXT. COUNTRY ROAD - DAY30\n30\nJohn, now carrying Sherlock back towards the tent. (We now\nintercut between Baker Street and here as required.)\nJOHN\nWhen did we agree that?\nSHERLOCK\nWe discussed it yesterday. Stop.\nLower.\nJohn is now lowering the laptop for a closer view of the\ngrass.\nJOHN\nI wasn’t even home yesterday. I was\nin Dublin.\nSHERLOCK\nHardly my fault if you weren’t\nlistening.\nOn Sherlock - as the doorbell rings. He glances off.\nSHERLOCK\n(Yelling off)\nShut up!\nJOHN\nDo you just keep talking when I’m\naway?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n15.\n\n\nSHERLOCK\nI don’t know - are you away often?\nNow show me the car.\nHe swings round to show Phil’s car.\nSHERLOCK\nAnd that’s the one that back-fired -\nit made a noise, yes?\nJOHN\nIf you’re thinking gunshot, there\nwasn’t one. He wasn’t shot, he was\nkilled by a single blow to the back\nof the head from a blunt\ninstrument. Which then magically\ndisappeared along with the killer.\nThis has got to be an eight, at\nleast.\nCARTER\nYou’ve got two more minutes. And\nthen I want to know more about the\ndriver...\nSHERLOCK\nOh, forget him, the driver’s an\nidiot. Why else would he think he’s\na suspect?\nCARTER\nI think he’s a suspect.\nSHERLOCK\n(Sighs)\nTake me over.\nJOHN\nOkay, but there’s a mute button and\nI will use it.\nHe turns the laptop to face Carter.\nSHERLOCK\nUp a bit. I’m not talking from down\nhere.\nBiting his lip, John raises the laptop to nearly eye-level.\nWe stay on the laptop screen as Sherlock talks. (Under this,\nwe start building helicopter noise - not emphasised, but\nslowly increasing.)\nSHERLOCK\nHaving driven to a remote location,\nand successfully committed a crime\nwithout a single witness, why did\nhe then phone the police and\nconsult a detective? Fair play?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n16.\n\n\nCARTER\nWell he’s trying to be clever,\nisn’t he? It’s over-confidence.\nSHERLOCK\nDid you see him? Morbidly\nobese, the undisguised halitosis of\nsingle man who lives alone, the\nright sleeve of an internet porn\naddict, and the breathing pattern\nof an untreated heart condition.\nLow self-esteem, tiny IQ, and\nlimited life expectancy - and you\nthink he’s an audacious criminal\nmastermind?\nHe looks over his shoulder, revealing the driver (Phil)\nsitting on the sofa directly behind him, a little troubled\nnow.\nSHERLOCK\nDon’t worry, this is just stupid.\nPHIL\nWhat did you say? Heart what?\nSHERLOCK\n(Turning back to the\ncomputer)\nHave you looked in the stream yet?\nCARTER\nWhat’s in the stream?\nSHERLOCK\nGo and see.\nMRS HUDSON\n(From off)\nSherlock?\nMRS HUDSON, standing in the doorway - looking a bit nervous.\nBehind her, TWO MEN IN DARK SUITS. One of them is PLUMMER.\nMRS HUDSON\nYou weren’t answering your\ndoorbell...\nPLUMMER\n(To the other man)\nHis room’s through the back, get\nhim some clothes.\nSHERLOCK\nWho the hell are you??\nPLUMMER\nSorry, Mr. Holmes -\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n17.\n\n\nJOHN\n(Protesting from the\ncomputer)\nWhat’s going on? Sherlock, what’s\nhappening?\nPlummer has reached over and shut the laptop, cutting off\nJohn.\nPLUMMER\n- you’re coming with us.\n"
    },
    {
        "scene": "EXT. COUNTRY ROAD - DAY39\n39\nJohn, at the laptop, trying to fix the connection.\nJOHN\nSorry, he got cut off, I don’t -\nYOUNG POLICEMAN\nDr. Watson?\nJohn glances round - the YOUNG POLICEMAN is turning towards\nhim, phone at his ear. He looks a little bemused.\nYOUNG POLICEMAN\nIt’s for you.\nJOHN\nMe? Okay.\nHe puts his hand out for the phone, but the young policeman\nshakes his head.\nYOUNG POLICEMAN\nNo, sir. The helicopter.\nJohn follows his look.\nA little distance away, a HELICOPTER is landing.\nOn John’s face: what??\nINT. 221B BAKER STREET - DAY\n40\n40\nOn Sherlock’s CLOTHES being placed in a neat pile in front of\nhim. Sherlock, still standing, defiant in his bedsheet.\nPLUMMER\nPlease, Mr. Holmes. Where you’re\ngoing, you’ll want to be dressed.\nOn Sherlock’s eyes - scanning the man.\nSHERLOCK VISION: We now see the man through Sherlock’s\npersonal heads-up display - words floating over different\nparts of the man’s body - all this fast.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n18.\n\n\nOver the jacket - SUIT: £700.\nOver the armpit - UNARMED.\nOver the hand - MANICURED. OFFICE WORKER. LEFT HANDED.\nOver the shoes - INDOOR WORKER\nOver the lower part of the trousers - we zoom in super-fast\nto see tiny dog hairs, and the words starting popping up:\nSMALL DOG. TWO SMALL DOGS. THREE SMALL DOGS.\nSherlock, smiling faintly now.\nSHERLOCK\nOh, I know exactly where I’m going.\nOn this we dissolve to:\n"
    },
    {
        "scene": "EXT. BUCKINGHAM PALACE - DAY41\n41\nBuckingham Palace, seen from the air, the roar of a\nhelicopter all around us.\nOn John, sitting in the helicopter, staring down at their\ndestination.\nNo! Can’t be, no!\nINT. BUCKINGHAM PACE - CORRIDOR - DAY\n42\n42\nAnother of the DARK SUITED MEN is leading JOHN down a vast,\nornate corridor.\nOn John, looking around. This is impossible, this is\nridiculous.\nINT. BUCKINGHAM PALACE - GRAND ROOM - DAY\n43\n43\nA pair of double doors are swept open, revealing a huge,\nspectacular room, empty, except for ...\n... SHERLOCK HOLMES, sitting on an ornate sofa, right in the\nmiddle, still wrapped in a bedsheet and clearly in a towering\nsulk.\nOn JOHN, observing him from the door. The DARK SUITED MAN\nushers him in.\nJohn steps inside, the man withdraws.\nA silence as John and Sherlock look at each other. John\nspreads his hands - a questioning gesture, what the hell is\ngoing on?\nSherlock: shrugs back. Search me.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n19.\n\n\nJohn comes in to the room, sits on the other end of the sofa.\nAnother silence.\nJOHN\n... are you wearing pants?\nSHERLOCK\nNo.\nJOHN\nOkay.\nThey look at each other -\n- and then both just burst out laughing. Just the joyous\nabsurdity of it. Where they are, what they’re doing, for\nGod’s sake!!\nThrough the laughter:\nJOHN\nWhat are we doing here? Sherlock,\nseriously, what?\nSHERLOCK\nI don’t know!\nJOHN\nAre we here to see the Queen?\nThe thought almost quells the laughter for a second. And then\nthe door opens, and MYCROFT steps in.\nSHERLOCK\nApparently, yes.\nAnd this childish jokes sets them off again, roaring with\nlaughter.\nHugely annoyed. Mycroft bangs shut the door.\nMYCROFT\nJust once, could you two behave\nlike grown-ups.\nJOHN\nWe solve crimes, I blog about it,\nand he forgets his pants - how high\nare your standards?\nSHERLOCK\nI was in the middle of a case,\nMycroft!\nMYCROFT\nWhat, the hiker and the back-fire?\nI glanced at the police report -\nbit obvious, surely.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n20.\n\n\nSHERLOCK\nTransparent.\nMYCROFT\nTime to move on, then.\nMycroft has picked up Sherlock’s folded clothes from the\nchair.\nMYCROFT\nWe are in Buckingham Palace. The\nvery heart of the British nation.\n(Presents the clothes with\nmock formality)\nSherlock Holmes - put your trousers\non.\nSHERLOCK\nWhat for?\nMYCROFT\nYour client.\nSHERLOCK\nAnd my client is ... ?\nA voice from off.\nTHE EQUERRY\nIllustrious.\nThey look round.\nThere’s a side door, almost concealed in the ornate wall, and\nentering through is a formidable, older man. Probably an ex-\narmy officer, carries a truly frightening air of self-\npossession and importance.\nTHE EQUERRY\nIn the extreme. And remaining, I\nhave to inform you, entirely\nanonymous. Mycroft!\nMYCROFT\n(Shaking hands)\nHarry. Can I just apologise for the\nstate of my little brother.\nTHE EQUERRY\nA full time occupation, I imagine.\nAnd this must be Dr. John Watson,\nformerly of the Fifth\nNorthumberland Fusiliers?\nJOHN\n(Shaking his hand)\nHello, yes\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n21.\n\n\nTHE EQUERRY\nMy employer is a tremendous fan\nyour blog.\nJOHN\n... your employer?\nTHE EQUERRY\nParticularly enjoyed the one about\nthe aluminium crutch.\n(Turning to Sherlock)\nAnd Mr. Holmes, the younger. You\nlook taller in your photographs.\nSHERLOCK\nI take the precaution of a good\ncoat and a short friend.\nMycroft, I don’t do anonymous\nclients. I’m used to a mystery at\none end of my cases - both ends is\ntoo much work. Good morning.\nHe starts to head to the door. Mycroft puts out a foot, and\nstands on the trailing end of Sherlock’s sheet, stopping him\nin tracks.\nMYCROFT\nThis is a matter of national\nimportance. Grow up!\nSHERLOCK\nGet off my sheet.\nMYCROFT\nOr what?\nSHERLOCK\nI’ll just walk away.\nMYCROFT\nI’ll let you.\nJOHN\nBoys, please, not here.\nSHERLOCK\nWho is my client?\nMYCROFT\nTake a look at where you’re\nstanding and make a deduction - you\nare to be engaged by the highest in\nthe land. Now for Gods sake, put\nyour clothes on!\nINT. BUCKINGHAM PALACE - GRAND ROOM - DAY\n44\n44\nA few minutes later. The four of them having TEA. SHERLOCK is\nnow dressed. MYCROFT is pouring.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n22.\n\n\nMYCROFT\nI’ll be mother.\nSHERLOCK\nAnd there’s a whole childhood in a\nnutshell.\nTHE EQUERRY\nMy employer has a ... problem.\nMYCROFT\nA matter has come to light of an\nextremely delicate, and potentially\ncriminal nature - and in this hour\nof need, dear brother, your name\nhas arisen.\nSHERLOCK\nWhy? You have a police force - of\nsorts. Even a marginally secret\nservice. Why come to me?\nTHE EQUERRY\nPeople do come to you for help,\ndon’t they, Mr. Holmes?\nSHERLOCK\nNot, to date, anyone with a navy.\nMYCROFT\nThis is a matter of the highest\nsecurity, and therefore of trust.\nJOHN\nYou don’t trust your own secret\nservice?\nMYCROFT\nNaturally not. They all spy on\npeople for money.\nSHERLOCK\nFair point.\nJOHN\nBut it’s Sherlock you want - what\nam I doing here?\nTHE EQUERRY\nI did wonder myself, Mycroft.\nMYCROFT\nMy baby brother is a genius in his\nchosen field. But in this case, we\nneed a genius with a conscience -\nwhich, typically, my brother has\noutsourced.\nJOHN\nOh, great. I’m Jiminy Cricket.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n23.\n\n\nThe Holmes brothers both laugh - a rare moment of bonding.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n23A.\n\n\nMYCROFT\nActually, that rather works.\nSHERLOCK\nIt does, doesn’t it?\nTHE EQUERRY\n(Sharply)\nI do think we have a timetable.\nMYCROFT\nOf course, yes.\nHe has taken an ENVELOPE from his CASE, now slides a\nPHOTOGRAPH from it. He passes it to Sherlock.\nMYCROFT\nWhat do you know about this woman?\nOn the photograph - a headshot of a stunningly beautiful\nwoman. And as we see this we cut to:\nINT. LIMO - DAY\n45\n45\nThe same WOMAN - IRENE ADLER - but live. She’s sitting the\nback of the car, looking boredly, but imperiously, out of the\nwindow. Her phone beeps, she glances at it:\nScreen text: I’M SENDING YOU A TREAT.\nSHERLOCK\n(V.O.)\nNothing whatsoever.\nCUT TO:\nINT. BUCKINGHAM PALACE - GRAND ROOM - DAY\n46\n46\nOn SHERLOCK as he  now flicks the photo around for JOHN, as\nif trying it out on him. John, sipping his tea, almost\nmisses.\nSHERLOCK\n- but she’s clearly very\nattractive. John, you might want to\ndab your shirt front. Who is she?\nINT. SMART HOUSE IN BELGRAVIA - DAY\n47\n47\nThe LIMO has drawn up at a lovely London town house. The\nFEMALE CHAUFFEUR is now walking round to open the rear\ndoor... (We continue hearing the conversation at Buckingham\nPalace.)\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n24.\n\n\nMYCROFT\n(V.O.)\nIrene Adler. Professionally  known\nas the Woman.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n24A.\n(MORE)\n\n\nJOHN\n(V.O.)\nProfessionally?\nIRENE ADLER now stepping out the car - spectacular in\nspectacular heels.\nMYCROFT\n(V.O.)\nThere are many names for what she\ndoes - she prefers dominatrix.\nIrene, now heading towards the house. She glances at her\nphone.\nScreen text: PHOTOS DOWNLOADING.\nINT. BUCKINGHAM PALACE - GRAND ROOM - DAY\n48\n48\nSHERLOCK\nDominatrix?\nMYCROFT\nDon’t be alarmed. It’s do to with\nsex.\nSHERLOCK\nSex doesn’t alarm me.\nMYCROFT\nHow would you know? She provides,\nyou might say, recreational\nscolding to those enjoy that sort\nof thing, and are prepared to pay\nfor it.\nHe’s now passing Sherlock several COLOURFUL PRINTED SHEETS\n(clearly a printed-out website.)\nMYCROFT\nThis is all from her website.\nOn the sheets. A page of material, with the masthead that\nreads The Woman. The page prominently illustrated with photos\nof IRENE in various kinds of terrifying and sexy fetish gear.\nHe flicks to the second page -\n- but the picture becomes -\nCUT TO:\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n25.\nMYCROFT (cont'd)\n\n\nINT. IRENE’S BEDROOM - DAY\n49\n49\n- close on IRENE’s phone -\nA photograph, on a long lens of SHERLOCK in Baker Street.\nHe’s wrapped in the sheet we saw him in earlier, and being\nmanhandled into the car, by the two dark-suited men. He looks\npreposterous and vulnerable.\nShe flicks to the second photograph -\n- but the picture becomes -\nCUT TO:\nINT. BUCKINGHAM PALACE - GRAND ROOM - DAY\n50\n50\n- IRENE in spectacular fetish gear, brandishing a whip,\nmenacingly -\nSherlock flicks to the next sheet but it becomes -\nCUT TO:\nINT. IRENE’S BEDROOM - DAY\n51\n51\nIRENE’s phone: closer on SHERLOCK, vulnerable is sheet -\nOn Irene’s face, looking at his. She smirks, amused\nCUT TO:\nINT. BUCKINGHAM PALACE - GRAND ROOM - DAY\n52\n52\nOh Sherlock’s face. He frowns in distaste, puts the sheets\nface down on the table.\nSHERLOCK\nI assume this Adler woman has some\ncompromising photographs.\nTHE EQUERRY\nYou’re very quick, Mr. Holmes.\nSHERLOCK\nHardly a difficult deduction.\nPhotographs of whom?\nTHE EQUERRY\nA person of significance to my\nemployer.\nSHERLOCK\nFamily member, friend, distant\nrelative ... ?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n26.\n\n\nTHE EQUERRY\nWe prefer not be more specific at\nthis time.\nSHERLOCK\nAnonymous client, anonymous victim -\nwould it help if I investigated\nwearing a blindfold?\nJOHN\nYou can’t tell us anything?\nMYCROFT\nI can tell you, it’s a young\nperson.\n(Hesitates)\nA young female person.\nSHERLOCK\nHow many photographs?\nMYCROFT\nA considerable number, apparently.\nSHERLOCK\nDo Miss Adler and this young female\nperson appear in the photographs\ntogether?\nMYCROFT\nYes, they do.\nSHERLOCK\nI assume in a variety of\ncompromising scenarios.\nMYCROFT\nAn imaginative range, we’re\nassured.\nA silence. They digest.\nSHERLOCK\n... John, you probably want to keep\nthat cup in the saucer now.\nJohn has had the cup frozen half-way to his mouth.  He now\ndelicately sets it down.\nTHE EQUERRY\nIt is our opinion that should these\nphotographs come to light, they\nwould have a catastrophic effect on\nthe establishment you see around\nyou. Can you help us, Mr. Holmes?\nSHERLOCK\nHow?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n27.\n\n\nTHE EQUERRY\nWill you take the case?\nSHERLOCK\nWhat case? Pay her. Now, and in\nfull. As Miss Adler remarks on her\nmasthead - know when you are\nbeaten.\nMYCROFT\nShe doesn’t want anything.\nShe got in touch. She informed us\nthat the photographs existed. She\nindicated that she had no intention\nto use them to extort either money\nor favour.\nJOHN\n... Then why get in touch at all?\nMYCROFT\nWe don’t know.\nOn Sherlock - now the ghost of a smile. Intrigued for the\nfirst time.\nSHERLOCK\n... oh! A power play. A power play\nwith the most powerful family in\nBritain. Now that’s a dominatrix.\nOh this is getting a bit fun now,\nisn’t it?\nJOHN\nSherlock!\nSHERLOCK\nWhere is she?\nMYCROFT\nIn London, currently. She’s staying\nat -\nSHERLOCK\nText me the details. I’ll be in\ntouch by the end of the day.\nHe’s heading for the door now, John following.\nTHE EQUERRY\nDo you really think you’ll have\nnews by then?\nSHERLOCK\nNo. I think I’ll have the\nphotographs.\nHe turns to sweep out.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n28.\n\n\nTHE EQUERRY\nOne can only hope you’re as good as\nyou seem to think.\nJust the tiniest flash in Sherlock’s eye. He turns back to\nhim -\n- the barest glimpse: SHERLOCK’s POV, words swirling round\nher. (None emphasised, but they include DOG LOVER, HORSE\nRIDER, EARLY RISER, LEFT SIDE OF BED, NON-SMOKER, FATHER,\nRIGHT-HANDED, KEEN READER, TEA DRINKER.)\nSHERLOCK\nI’ll need some equipment, of\ncourse.\nMYCROFT\nAnything you require, I’ll have it\nsend over.\nSHERLOCK\nCould I have a box of matches?\n- and now holds out a hand, expectantly, to the Equerry.\nTHE EQUERRY\nI’m sorry?\nSHERLOCK\nOr your cigarette lighter, either\nwould do.\nTHE EQUERRY\nI don’t smoke.\nSHERLOCK\nI know you don’t. But your employer\ndoes.\nAn impasse of stares -\n- then the Equerry reaches into his pocket, produces a\nlighter, hands it to Sherlock.\nTHE EQUERRY\nWe have kept lot of people\nsuccessfully in the dark about this\nlittle fact, Mr. Holmes.\nSHERLOCK\nI’m not the commonwealth.\nJOHN\nAnd that’s as modest as he gets.\nPleasure to meet you.\nHe gives a little bow. Sherlock glances contemptuously at him\n- the fawner!\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n29.\n\n\nSHERLOCK\nLaters.\nHe heads out, John following.\nINT. TAXI - DAY\n54\n54\nSHERLOCK and JOHN, in the back of the taxi, as it drives away\nfrom BUCKINGHAM PALACE.\nJOHN\nOkay - the smoking, how did you\nknow?\nSHERLOCK\nThe evidence was right under your\nnose, John - as ever you see, but\nyou do not observe.\nJOHN\nObserve what?\nHe pulls something from his coat, tosses it to John.\nSHERLOCK\nThe ashtray.\nHe tosses a stolen ashtray to John.\nJohn laughs - and then they’re both sniggering like\nschoolboys.\n"
    },
    {
        "scene": "EXT. THE MALL - DAY55\n55\nAs the car sweeps away from us along the Mall, the picture\nclicks and freezes, becoming a photograph on -\nINT. IRENE’S BEDROOM - DAY\n56\n56\n- IRENE’s phone.\nWider on Irene. She’s on the edge of her bed, smiling now.\n(The bedroom around, as wild and dangerous as you’d expect.)\nIRENE ADLER\nKate?\nThe Chauffeur, now dressed as a MAID.\nIRENE ADLER\nWe’re going to have a visitor. I’ll\nneed a bit of time to get ready.\nKATE\nA long time.\nIrene smiles - a demonic grin.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n30.\n\n\nIRENE ADLER\nOh, ages!\nWe cut to darkness -\n- then the screen splits into light as wardrobe doors are\nflung open. We are looking Irene through endless rails of\ndresses ...\nINT. 221B BAKER STREET - DAY\n57\n57\nJOHN, standing in the kitchen. He’s looking, a little\nimpatiently, into the back corridor (where Sherlock’s room\nis.)\nAs we watch, various items of clothing are tossed through\nSherlock’s open door - a SOLDIER’S UNIFORM, WORKMAN’S\nOVERALLS - as each is rejected. A TUXEDO joins the pile.\nJOHN\nWhat are you doing?\nSherlock appears through the door, with a policeman’s jacket\nslung over his normal clothes.\nSHERLOCK\nI’m going into battle, John. Need\nthe right armour.\n(Looks down at his police\njacket)\nNah!\nHe disappears back into his room, pulling the jacket off.\nINT. IRENE’S BEDROOM - DAY\n58\n58\nIRENE modeling a startling mini-dress in the mirror.\nConsiders, then -\nIRENE ADLER\nNah.\nKate is leaning in the doorway, watching appreciatively.\nKATE\nWorks for me.\nIRENE ADLER\nEverything works on you.\nKATE\nIs that bad?\nIRENE ADLER\nI hope so.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n31.\n\n\nINT. TAXI - DAY\n59\n59\nJOHN and SHERLOCK in the back of a taxi.\nJOHN\nSo what’s the plan?\nSHERLOCK\nWe know her address.\nJOHN\nSo what do we do. Ring the\ndoorbell?\nSHERLOCK\nExactly.\n(Leaning forward, to the\ncabbie)\nHere please.\nJOHN\nBut you didn’t even change your\nclothes.\nSHERLOCK\nThen it’s time to add a splash of\ncolour.\nINT. IRENE’S BEDROOM - DAY\n60\n60\nIRENE, at her make-up table.\nKATE is delicately applying her make-up. Their eyes meet for\na moment - a flirtatious smile...\nINT. A BACK ALLEY - DAY\n61\n61\nA back alley - smart, but deserted. JOHN and SHERLOCK heading\ntowards us. Beyond them, we can see the TAXI leaving from the\nend of the alley.\nJOHN\nAre we here?\nSHERLOCK\nCouple of streets away. But this\nwill do.\nJOHN\nFor what?\nSherlock rounds on John.\nSHERLOCK\nPunch me in the face.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n32.\n\n\nINT. IRENE’S BEDROOM - DAY\n62\n62\nKate is holding up a range of lipsticks for IRENE’s approval.\nKATE\nShade?\nOn Irene - that demonic smile again.\nIRENE ADLER\nBlood.\n"
    },
    {
        "scene": "EXT. A BACK ALLEY - DAY63\n63\nSHERLOCK and JOHN in confrontation.\nJOHN\nPunch you?\nSHERLOCK\nYes, punch me. In the face, didn’t\nyou hear me?\nJOHN\nI always hear “punch me in the\nface” when you’re speaking. But\nit’s usually subtext.\nSHERLOCK\nOh for God’s sake.\nAnd smartly and efficiently, he just slaps John round the\nface. John is whacked right back out of shot -\n- and then a beat later comes tearing back into frame, fists\nflailing at Sherlock.\nINT. IRENE’S BEDROOM - DAY\n64\n64\nKate, sitting very close, is now applying IRENE’s lipstick.\nTheir eyes meet again.\n"
    },
    {
        "scene": "EXT. A BACK ALLEY - DAY65\n65\nJOHN now has SHERLOCK in a headlock, and the struggle\ncontinues.\nSHERLOCK\nOkay! I think we’re done now.\nJOHN\nYou want to remember, Sherlock, I\nwas a soldier! I killed people!\nSHERLOCK\nYou were a doctor!!\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n33.\n\n\nJOHN\nI had bad days!!\nINT. IRENE’S BEDROOM - DAY\n66\n66\nKate, applying the finishing touches.\nKATE\nWhat are you going to wear?\nIRENE ADLER\nMy battledress.\nKATE\nLucky boy.\nWe hear the doorbell ring.\nKATE\nIs that him?\nIRENE ADLER\nGot to be.\nKATE\nRinging the doorbell? Does he think\nwe’ll just let him in?\nIRENE ADLER\nHe must think he’s got a way of\npersuading us. Go and see what it\nis.\nINT. HALLWAY OF IRENE’S HOUSE - DAY\n67\n67\nOn Kate, now making her way down the hallway.\nShe presses the entry phone unit next to the door.\nKATE\nHello?\nOn the little screen, we see SHERLOCK, seeming bent over, as\nif injured.\nSHERLOCK\n(On screen)\nI’m sorry, I’m sorry, I’ve been\nattacked - I think they took my\nwallet - please could you help me\n...\nKate’s face - amused.\nKATE\nI could phone the police, if you\nwant.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n34.\n\n\nSHERLOCK\n(On screen)\nYes, please, if you could. Do you\nmind if I just wait out here?\nOn screen, he straightens up slightly -\n- reveal that he’s wearing a clerical collar.\nOn Kate’s face - oh, he’s pretending to be a vicar. A knowing\nsmirk - which she hides as she starts opening the door -\n- to reveal Sherlock, and (to her surprise) John, seemingly\nhelping him.\nJOHN\nI saw it happen - It’s okay, I’m a\ndoctor.\nAnd before she can stop them, they’re through the door.\nINT. IRENE’S LIVING ROOM - DAY\n68\n68\nA sumptuous, and very respectable, living room. Sherlock,\nalone, is perched on the end of a sofa, dabbing at his\nbruised face.\nWe hear a door open behind him.\nIRENE ADLER\n(From off)\nHello, sorry to hear you’ve been\nhurt. I don’t think Kate caught\nyour name.\nSherlock, getting hurriedly to his feet.\nSHERLOCK\nYes, sorry, I’m -\nAnd he breaks off. For the first time ever, we see all the\nbrakes jam on in his brain as he just stares.\nBecause IRENE ADLER is standing in front of him, entirely\nnaked. (NB. This shot for pre-watershed. We know she is naked\nbut we don’t see anything. Like Sherlock, we always manage to\navert our eyes.)\nIrene is just smiling at him now.\nIRENE ADLER\nOh it’s always so hard to remember\nan alias when you’ve just had a\nfright, isn’t\nShe steps lightly forward, plucks off his clerical collar.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n35.\n\n\nIRENE ADLER\nThere now, we’re both defrocked -\nMr. Sherlock Holmes.\nSHERLOCK\nIrene Adler, I presume.\nOn Sherlock: on the back foot for once. And now she’s running\na finger along one of his cheekbones.\nIRENE ADLER\nLook at these cheekbones. I think I\ncould cut my hand slapping your\nface. Would you like me to try?\nWith an impish smile, she pops the clerical collar in her\nmouth, snapping her teeth shut on it.\n- just as John enters (bowl, towel, the cuts and bruises\nparaphernalia you find in any bathroom.)\nJOHN\nRight then, so ...\nAnd he stops dead at what he sees: Sherlock, fact to face\nwith a naked woman, who has his clerical collar in her teeth.\nJOHN\n... okay. Missed something, did I?\nIrene just smiles. Without a care in the world, she heads\nover to the other sofa, settles down on it. (Perhaps she\npicks up a cushion at this point - just to make the scene\nshootable.)\nIRENE ADLER\nPlease, sit down. If you’d like\nsome tea, I’ll call the maid.\nSHERLOCK\nI had some at the Palace.\nIRENE ADLER\nI know.\nSHERLOCK\nClearly.\nSherlock and Irene, now sitting on opposite - burning the air\nbetween them, with staring.\nJohn, feeling very out of it:\nJOHN\n... I had a tea at the palace too.\nIf anyone’s interested.\nThey clearly aren’t.\nOn Sherlock - something troubling him.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n36.\n\n\nSherlock’s POV. On Irene, just sitting there. As he glances\nover to John we see the normal swirl of words round him (TWO\nDAY SHIRT. ELECTRIC NOT BLADE. HAD A LARGE CAPPUCINO. DATE\nTONIGHT. HASN’T PHONED SISTER. NEW TOOTHBRUSH. NIGHT OUT WITH\nSTAMFORD.) but when he looks back to Irene -\n- nothing.\nHe blinks.\nNothing.\nBlinks again.\nNothing.\nIRENE ADLER\n(Tosses the dog collar in\nher hand)\nDo you know the big problem with\ndisguise, Mr. Holmes? However hard\nyou try, it’s always a self-\nportrait.\nSHERLOCK\nYou think I’m a vicar with a\nbleeding face?\nIRENE ADLER\nI think you’re damaged, delusional,\nand believe in a higher power -\nthough in your case, it’s yourself.\nAnd somebody loves you.\nOn Sherlock - a flicker of confusion.\nIRENE ADLER\nIf I had to punch you in the face\nI’d try to avoid your teeth and\nyour nose too.\nHer eyes to flash like lasers to John - who just bridles.\nJOHN\nCould you put something on, please?\nAnything at all - a napkin.\nIRENE ADLER\nWhy - are you feeling exposed?\nSherlock pulls his coat, from where it’s lying on the sofa\nnext to him. He tosses it over to Irene.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n37.\n\n\nSHERLOCK\nI don’t think John knows where to\nlook.\nIrene, now pulling the coat on.\nIRENE ADLER\nOh, I think he knows exactly where.\nI’m not sure about you.\nSHERLOCK\nIf I wanted to look at naked women,\nI’d borrow his laptop.\nJOHN\nYou do borrow my laptop.\nSHERLOCK\nI confiscate it.\nIRENE ADLER\nNever mind all that, we’ve got\nbetter things to talk about. Tell\nme, I need to know - how was it\ndone.\nSHERLOCK\n.... what?\nIRENE ADLER\nThe hiker with the bashed in head.\nHow was he killed?\nSherlock and John exchanging a look - what?\nSHERLOCK\nThat’s not why I’m here.\nIRENE ADLER\nNo, you’re here for the\nphotographs. But you’re never going\nto get them, so seeing as we’re\nchatting anyway...\nOn Sherlock - something new here. Something he’s not quite in\ncontrol of. But he’s keeping it calm, staying impassive.\nJOHN\nThat story hasn’t even been on the\nnews. How do you know about it?\nIRENE ADLER\nI know one of the policemen. Well -\nI know what he likes.\nJOHN\nWhat, and you like policemen?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n38.\n\n\nIRENE ADLER\nI like detective stories. And\ndetectives. Brainy - it’s the new\nsexy.\nSHERLOCK\nThe position of the car.\nJohn and Irene look at him. What?\nSHERLOCK\nThe position of the car, relative\nto the hiker, at the time of the\nbackfire. That plus the fact that\nthe death blow was on the back of\nhis head. All the information you\nneed.\nIRENE ADLER\nOkay, tell me. How was he murdered?\nSHERLOCK\nHe wasn’t.\nIRENE ADLER\nYou don’t think it was murder.\nSHERLOCK\nI know it wasn’t.\nIRENE ADLER\nHow?\nSHERLOCK\nThe same way I know the victim was\nan excellent sportsman, recently\nreturned from foreign travel. And\nthat the photographs I’m looking\nfor are in this room.\nIRENE ADLER\nOkay, but how?\nSHERLOCK\n(Springing to his feet)\nSo they are in this room - thank\nyou! John, outside, man the door,\nlet no one in.\nJohn is already heading to the door.\nAs he passes, Sherlock the tiniest look of complicity flashes\nbetween them. They’re up to something, and this is part of\nthe plan -\nOn Irene: what’s going on?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n39.\n\n\nINT. HALLWAY OF IRENE’S HOUSE - DAY\n69\n69\nJohn emerging from the room, closing the door. Looks around,\nthen up at the ceiling. Sees what he needs.\nNow steps across the hallway, takes a magazine from a table,\nrolls it up ...\n... and from this jacket he takes the lighter the Equerry\ngave Sherlock ...\nINT. IRENE’S LIVING ROOM - DAY\n70\n70\nSherlock swanning around the room, in his element now -\nexplaining!\nSHERLOCK\nOkay. Two men, alone in\ncountryside, several yards apart,\nand one car...\nIRENE ADLER\nOh, I thought you were looking for\nthe photographs now?\nSHERLOCK\nOh, no, looking takes ages! I’m\njust going to find them. But we’ve\ngot a minute, and you’re moderately\nclever, so let’s pass the time. Two\nmen, a car, and nobody else.\n"
    },
    {
        "scene": "EXT. COUNTRY ROAD - DAY71\n71\nNow FLASHBACKING to the earlier scene, but in SHERLOCK\nVISION. PHIL is at the wheel of his car, trying to start his\ncar - he’s in freeze-frame.\nSHERLOCK\n(V.O.)\nThe driver’s trying to fix\nhis engine ...\nNow SHERLOCK walks past Phil (in reality, still swanning\nabout Irene’s room talking to her, but visually now walking\namong the flashback.)\nSHERLOCK\nGetting nowhere.\nWhip pan to:\nOver at with HIKER, also frozen. He’s standing, seemingly\nstaring at the sky\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n40.\n\n\nSHERLOCK\n(V.O.)\nAnd the hiker is taking a moment.\nLooking at the sky. Watching the\nbirds?\nAnd SHERLOCK steps from behind FROZEN HIKER. (Again still\nreally swanning about Irene’s room, but stitched into the\nflashback.)\nSHERLOCK\nAny moment now something’s going to\nhappen. What?\nWe cut to Irene, still sitting on the sofa - but now the sofa\nis SITTING IN THE THE MIDDLE OF THE FIELD. Beyond her, we can\nsee Phil in the car.\nIRENE ADLER\nThe hiker’s going to die.\nSHERLOCK\nNo. That’s the result. What’s going\nto happen.\nIRENE ADLER\n... I don’t understand.\nSHERLOCK\nTry to.\nIRENE ADLER\nWhy?\nSHERLOCK\nBecause your job is ridiculous.\nBecause you cater to the whims of\nthe pathetic and take your clothes\noff to make an impression. Stop\nboring me and think. It’s the new\nsexy.\nOn Irene - those words landing like slaps. Regroups.\nIRENE ADLER\n... the car’s going to backfire.\nSHERLOCK\nThere’s going to be loud noise.\nIRENE ADLER\nSo what?\nSHERLOCK\nOh, noises are important. Noises\ncan tell you everything. For\ninstance -\nAnd the beep-beep-beep-beep-beep. The shrill of smoke alarm.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n41.\n\n\nSuper fast zoom on Sherlock’s eyes. Stylised slow-motion, as\nthey swivel to look at Irene with a big, slamming sound\neffect.\nOn Irene: stylised slow motion as the turns her to look at -\n- big slamming sound effect -\n- an ornate mirror on the wall.\nSHERLOCK\nThank you!\nSherlock start striding towards the mirror.\nSHERLOCK\nA mother, hearing a smoke alarm,\nwould look towards her child ...\nHe slides the mirror to one side, revealing a safe built into\nthe wall, with a keypad on it.\nSHERLOCK\nI really hope you don’t have a baby\nin here.\n(Calls off)\nYou can turn it off, John.\nINT. HALLWAY OF IRENE’S HOUSE - DAY\n72\n72\nJohn is standing in the hallway - has the magazine held aloft\nlike a torch, one end lit and smoking right under a smoke\nalarm.\nHe now beats against the wall, putting it out.\nSHERLOCK\n(Yelling from)\nI said turn it off.\nJOHN\nWell give me a moment -\nAnd then, from off - a calm American voice -\nNEILSON\nExcuse me -\nJohn looks round.\nThree men standing in the hallway now. Big, black suits,\nsquare-jawed - traditional men in black. NEILSON, Tranter,\nARCHER.\nNEILSON\nLet me take care of that for you.\nAnd Neilson draws a gun with silence from under his jacket,\naims it at the alarm, and shoots it. It falls silent.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n42.\n\n\nJOHN\n... thanks.\nINT. IRENE’S LIVING ROOM - DAY\n73\n73\nSherlock, examining the keypad.\nSHERLOCK\nYou should use a glove on these\nthings, you know - ever seen the\nstate of an iPad screen? Now the\nheaviest oil deposit is always on\nthe first key used - that’s clearly\na 3 - but the sequence is almost\nimpossible to read after that. I\nknow from the make it’s a six digit\ncode, and it can’t be your birthday\n- no disrespect, but you were\nclearly born in the 80s and the\neight is barely used - so -\nIRENE ADLER\nI’d tell you the code right now -\nbut you know what?\nHe looks at her.\nIRENE ADLER\nI already have.\nOn Sherlock - frowns. What?\nIRENE ADLER\nThink!\nAnd now the door is bursting open. John is being shoved into\nthe room, slammed down to his knees - Archer takes John,\nTranter takes Irene, Neilson walks among them, barking\norders.\nNEILSON\nHands behind your head, on the\nfloor, keep it still!\nJOHN\nSorry, Sherlock.\nNEILSON\nMiss Adler, on the floor!\nArcher stays behind John, gun leveled at his head. The other\ntwo men move swiftly into the room - Neilson has his gun on\nSherlock.\nNeilson has his gun on Sherlock.\nOn Sherlock, staring down the barrel, cool as ever.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n43.\n\n\nSHERLOCK\n... don’t you want me on the floor\ntoo?\nNEILSON\nNo, sir - I want you to open the\nsafe.\nSHERLOCK\nAmerican. Interesting. Why would\nyou care -\nNEILSON\nSir, the safe, now please.\nSHERLOCK\nI don’t know the code.\nNEILSON\n(Touches his ear)\nWe’ve been listening. She said she\ntold you.\nSHERLOCK\nIf you’ve been listening, you know\nshe didn’t.\nHe raises his gun slightly, so it’s pointing directly at\nSherlock’s forehead.\nNEILSON\nI’m assuming I missed something -\nfrom your reputation, I’m assuming\nyou didn’t - Mr. Holmes.\nJOHN\nFor God’s sake, she’s the one who\nknows - ask her!!\nNEILSON\nYes, sir. She also knows the code\nthat automatically calls the\npolice, or sets off the burglar\nalarm - I’ve learned not to trust\nthis woman.\nIRENE ADLER\nMr. Holmes -\nNEILSON\nShut up! One word out of you, just\none, I will decorate that wall with\nthe insides of your head. This, for\nme, will not be hardship.\nIrene falls silent - looks to Sherlock. Something intense in\nher gaze, like she’s trying to communicate something.\nNEILSON\nMr. Archer, at the count of three,\nshoot Dr. Watson.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n44.\n\n\nJOHN\nOh, for God’s sake, what??\nSHERLOCK\nI don’t know the code.\nNEILSON\nOne.\nSHERLOCK\nI don’t know the code!\nNEILSON\nTwo.\nSHERLOCK\nShe didn’t tell me, I don’t know\nit!!\nNEILSON\nI’m prepared to believe you - any\nsecond now. Three!\nSHERLOCK\nNo, stop!!\nAnd he’s got it! The lights go on in his head.\nHe spins to the keypad. His hand over it now. Cutting fast\nround -\nSherlock’s face: is he right?\nIrene’s face: fascinated!\nJohn’s face: oh shit!\nAnd now Sherlock is punching in a code - six rapid beeps. And\nthe safe chimes. And the LED display reads OPEN.\nOn Sherlock sags. So close.\nOn John: oh dear God! But keeping it together.\nNEILSON\nThank you, Mr. Holmes. Open it,\nplease.\nNow, very fast - Sherlock glances to Irene -\n- Irene, stricken-faced - tiniest shake of her head -\n- Sherlock, a frown, a flicker of thought, gets it - now\nreaching for safe door -\nSHERLOCK\nVatican cameos!\nOn John, hearing that, recognising the words - what?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n45.\n\n\nNow, stylised show motion -\n- Sherlock slams open the safe door -\n- in the same moment, he starts to duck -\n- close on the interior of the safe, as the door opens -\n- a handgun (also with silencer) mounted on a little tripod,\npointing out. A cable runs from the door, through hooks or\nhoops, arranged so that the cable runs right over the trigger\n-\n- the action of the opening door, now tightening the cable\nover the trigger -\n- closer on the silenced muzzle as the bullet explodes from\nthe end -\n- Archer, standing behind the still kneeling John, is the\ndirect line of fire -\n- he starts to crumple -\n- on Neilson, turning in shock - and Sherlock is already\ncannoning into him -\n- on Irene. She’s still kneeling in front of Tranter, who\nstands behind her, gun at her head -\n- and now she’s throwing punch backwards over her shoulder,\nright into the man’s groin\n- he starts to crumple -\n- on John, leaping to retrieve the gun from Archer as he\nfalls -\nNormal speed.\nSherlock has grabbed Neilson’s gun, now has it trained on\nNeilson who is sprawled on the floor in front of him.\nSimilarly, Irene has Tranter’s gun aimed at him, as he’s\ndoubled up, retching on the floor.\nJohn is checking Archer.\nJOHN\n... okay. He’s dead.\nThey all look at each other. What do they do now?\nSherlock steps smartly over Neilson, clubs him from behind\nwith the gun butt. He falls limps.\nSHERLOCK\n(To IRENE)\nWould you mind?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n46.\n\n\nIRENE ADLER\nNot at all.\nShe moves to do the same to Archer. As she does so, Sherlock\nglances towards the safe - there’s a little leopard skin\nobject in there.\nThump! Archer hits the floor.\nSHERLOCK\nThank you.\nIRENE ADLER\nThank you - you’re very ...\nobservant.\nJOHN\nObservant?\nIRENE ADLER\nI’m flattered.\nSHERLOCK\n(Striding from the room)\nDon’t be.\nJOHN\nFlattered? Sorry, what?\nHe’s following Sherlock from the room.\nINT. HALLWAY OF IRENE’S HOUSE - DAY\n74\n74\nSherlock is striding for the front door.\nSHERLOCK\nThere must be more of them -\nthey’ll have back-up watching the\nhouse.\nJOHN\nWe should call the police.\nSHERLOCK\nYes.\nSherlock has opened the door. In one motion he yanks the\nsilencer off the gun, and fires up into the sky. Blam! Blam!\nBlam! Blam! Blam!\nSHERLOCK\nOn their way.\nJOHN\nOh, for God’s sake.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n47.\n\n\nSHERLOCK\nShut up, it’s quick. Check the rest\nof the house, see how they got in.\nINT. IRENE’S LIVING ROOM - DAY\n75\n75\nIRENE is at the safe, looking inside for something.\nSHERLOCK\n(From off)\nWell that’s the Knighthood in the\nbag.\nShe spins. SHERLOCK, leaning in the doorway. He tosses\nsomething in his hand.\nCloser on it. A phone with a built in camera, blackberry-\nstyle, but funkier. A leopard skin cover, a fetishists phone,\nsomething we’d instantly recognise.\nIRENE ADLER\nThat’s mine.\nSHERLOCK\nI take it they’re all on here? The\nphotographs.\nHe presses a button.\nClose on the screen -\nI AM\nLOCKED\nFour boxes appear in the centre of the screen, for the number\nto be typed, so that it now appears\nI AM\n[] [] [] []\nLOCKED\nIRENE ADLER\nI have other copies, of course.\nSHERLOCK\nNo, you don’t. You’ll have\npermanently disabled any kind of\nconnection or uplink - unless the\ncontents of this phone are provably\nunique, you wouldn’t be able to\nsell them.\nIRENE ADLER\nWho says I’m selling?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n48.\n\n\nSHERLOCK\n(Looking at the three\nprone men)\nBut why are they interested?\nWhatever’s on here, it’s more than\njust photographs...\nA cold stare from Irene. No flirtatiousness now, deadly\nserious.\nIRENE ADLER\nIt’s my life, Mr. Holmes. My\nprotection.\nSHERLOCK\nIt was.\nHe tosses the phone in his hand again.\nJOHN\n(Calling from)\nSherlock!\nSherlock heads away.\nIrene: that cold stare for a moment - then starts to follow.\nINT. IRENE’S BEDROOM - DAY\n76\n76\nIrene’s spectacular bedroom. The TALL WINDOWS stand open -\nJOHN is kneeling by Kate who’s sprawled on the floor,\nunconscious.\nJOHN\nMust have come in this way.\nSHERLOCK\nClearly.\nIRENE is coming into the room now.\nJOHN\nShe’s okay, just out cold.\nIRENE ADLER\nWell God knows, she’s used to that.\nThere’s a back door - better check\nit, Dr. Watson.\nAnd she goes straight to her bedside table, rooting about in\nit for something.\nSherlock and John - exhange a glance. Blimey, she’s cold.\nSherlock gives John a nod.\nJOHN\nSure.\nJohn heads out.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n49.\n\n\nSHERLOCK\nYou’re very calm - your booby trap\njust killed a man.\nIRENE ADLER\nWell he’d have killed me - it was\nself-defence in advance.\nAnd she turns with what’s she taken from bedside cabinet -\n- and slams a hypodermic into his arm. Sherlock shoots to his\nfeet.\nSHERLOCK\nWhat?? What have you - ??\nHe’s reeling now, trying to grab the hypo from his arm. Irene\nslaps him hard across the face.\nIRENE ADLER\nGive it to me.\nHe staggers against the wall - tries to get away from her.\nShe steps calmly forward, slaps him hard again.\nIRENE ADLER\nNow! Give it to me!\nHe reels away from her, but clinging to consciousness,\ngripping on to that damn camera-phone.\nSHERLOCK\nNo!\nIRENE ADLER\nOh, for goodness sake!\nShe snatches up her riding crop from the bedside table - now\nslashes at him, calm and expert. More lion-tamer, than\nsadist.\nIRENE ADLER\nDrop it.\n(Slashes )\nI said, drop it!\nShe cracks him across the back of the hand. He drops the\ncamera-phone, with a cry.\nShe kneels by him, picks up the camera phone, smiles.\nIRENE ADLER\nThankyou, dear. Now tell that sweet\nlittle posh thing, the pictures are\nsafe with me. They’re not for\nblackmail, just insurance. Besides -\nI might want to see her again.\nHe makes a flailing grab for the camera-phone - she easily\navoids.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n50.\n\n\nIRENE ADLER\nNo, no - it’s been a pleasure,\ndon’t spoil it.\n(Tickle him under the chin\nwith her crop)\nThis is how I want you to remember\nme - the woman who beat you. Good\nnight, Mr. Sherlock Holmes.\nJOHN\nJesus!\nJohn has just come back through the door, staring now.\nJOHN\nWhat are you doing?\nIrene is already stepping to the window, starting to climb\nout.\nIRENE ADLER\nHe’ll sleep for a few hours. Make\nsure he doesn’t choke on his own\nvomit, it makes for a very\nunattractive corpse.\nJohn, now finding the hypodermic -\nJOHN\nWhat is this, what did you give\nhim. Sherlock??\nIRENE ADLER\nHe’ll be fine, I’ve used it on\nloads of my friends.\nJOHN\nSherlock, can you hear me??\nIrene, about to climb out the window, turns back for a\nmoment, contemplating Sherlock. He’s still grimly clinging to\nconsciously, trying to sit up, fighting for breath.\nIRENE ADLER\nYou know, I was wrong about him. He\ndid know where to look.\nJOHN\nFor what? What are you talking\nabout?\nIRENE ADLER\nThe keycode to my safe.\nJOHN\nWhat was it?\nIRENE ADLER\n(To Sherlock)\nShall I tell him?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n51.\n(MORE)\n\n\n(A best - smiles at John)\nMy measurements.\nOn John - oh!\nOn Sherlock, losing the fight - he flops back on the floor.\n- we hold on him a moment, and then:\nAnd then (a bit like with Phil the driver earlier) the camera\nspins on its axis, as if turning Sherlock upright again and\nwe:\n"
    },
    {
        "scene": "EXT. COUNTRY ROAD - DAY77\n77\n- this time it’s SHERLOCK, not Phil, sitting at the wheel. He\nlooks a little dazed, confused. The image is slightly,\ntwisted, distorted - dreamy.\nAnd where Sherlock swanned past last time, this time it’s\nIRENE.\nIRENE ADLER\nGot it!\nSherlock blinks confusedly at her.\nIRENE ADLER\nShh, now, don’t get up. I’ll do the\ntalking. So the car’s about to back-\nfire ... and the hiker ...\nShe looks to the HIKER. We whip pan to:\nThe frozen HIKER, staring at the sky. We widen the shot to\ninclude -\nSHERLOCK and IRENE, standing a few feet from him, observers\nonly. (Sherlock in his normal suit, Irene now in Sherlock’s\ncoat.)\nIRENE ADLER\n... is staring at the sky. You said\nhe could be watching the birds -\nbut he wasn’t, was he? He was\nwatching another kind of flying\nthing.\nBang!\nIRENE ADLER\nThe car back-fires, the hiker turns\nto look.\nThe Hiker turn to look behind him ...\nNow from the POV of something flying through the air, super-\nfast, towards the Hiker. We go slamming right into the back\nof the Hiker’s head, and the screen goes black.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n52.\nIRENE ADLER (cont'd)\n\n\nIRENE ADLER\nWhich was his big mistake ...\nOn Phil looking out his car, to see:\nPhil’s POV. The Hiker now lying dead.\nIRENE ADLER\nBy the time the driver looks up,\nthe hiker is already dead. What he\ndoesn’t see is what killed him -\nbecause it’s fallen in the stream.\nShot from above the stream, bubbling along.\nIRENE ADLER\n(From off)\nAn accomplished sportsman recently\nreturned from foreign travel - with\na boomerang.\nAnd there, floating downstream, is a blood-stained boomerang.\nWe pan up to see Sherlock and Irene watching it float away.\nIRENE ADLER\nYou got all that from one look.\nDefinitely the new sexy.\nSHERLOCK\nI ... I don’t ...\nCloser on Irene - now more stylised, she’s surrounded by\ndarkness.\nIRENE ADLER\nHush now, it’s okay.\n(Kissing his cheek)\nI’m only returning your coat.\nINT. SHERLOCK’S BEDROOM - NIGHT\n88\n88\nOn Sherlock startling awake!\nWhere is he?? In his bed! How the hell did he get here??\nSHERLOCK\nJohn! John!\nHe’s trying to climb out of bed now, so unsteady on his feet,\ndrunken.\nThe door is opening, John is there.\nJOHN\nYou okay?\nSHERLOCK\nHow did I get here?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n53.\n\n\nJOHN\nI don’t suppose you remember much,\nyou weren’t making a lot of sense.\nShould warn you, I think Lestrade\nfilmed you on his phone.\nSHERLOCK\nWhere is she?\nJOHN\nWhere’s who?\nSHERLOCK\nShe was here, the woman, that\nwoman.\nSherlock is looking around wildly - clearly no one else is\nhere. But the window - just a little open, curtain blowing in\nthe breeze.\nJOHN\nWhat woman?\nSHERLOCK\nThe woman - the woman woman.\nJOHN\nIrene Adler? She got away, no one\nsaw her - she wasn’t here,\nSherlock.\nSherlock is checking under his bed now. John is hauling him\nback to his feet.\nJOHN\nBack in bed, you’ll be fine in the\nmorning. Just sleep!\nSHERLOCK\nYes, of course I’ll be fine. I am\nfine, I’m absolutely fine!\nHe’s climbing unsteadily back into bed.\nJOHN\nYep, you are, you’re just great.\nI’ll be right next door if you need\nme.\nSHERLOCK\nWhy would I need you?\nJOHN\nNo reason at all\nAnd John goes, closing the door.\n- revealing something hanging on the hook on the back.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n54.\n\n\nSherlock doesn’t see it for a moment - then does. His coat -\nreturned.\nHe stares at it for a moment. How did that happen?\nAnd then - a little orgasmic gasp. Definitely female. Where\ndid that come from?\nOn his coat - something is glowing. He steps groggily, and\nretrieves his own phone from the own pocket. He’s received a\ntext (the gasp was the text arriving.) He reads it.\nTEXT ON SCREEN: Good night, Mr. Holmes.\nOn Sherlock’s face, frowning at the text. In the faint light\nof the phone, we see a kiss of lipstick on his cheek.\nINT. 221B BAKER STREET - MORNING\n89\n89\nOn MYCROFT, irate.\nMYCROFT\nHow about the foreign legion?\nMycroft is pacing the floor, furious. SHERLOCK and JOHN are\nhaving their breakfast, doing their best to ignore him. MRS\nHUDSON is cleaning up in the kitchen, and generally not being\na housekeeper.\nMYCROFT\nDoes one still join the foreign\nlegion, when in disgrace - what is\nthe modern form? Do you retire to\nthe study with a loaded revolver,\nor take a job in Manchester?\nSHERLOCK\nThe photographs are perfectly safe.\nMYCROFT\nIn the hands of a fugitive sex\nworker?\nSHERLOCK\nShe’s not interested in blackmail -\nI think she just wants ...\nprotection, for some reason. I take\nit you’ve stood down the police\ninvestigation into the shooting at\nher house?\nMYCROFT\nHow we can do anything, while she\nhas those photographs? Our hands\nare tied.\nSHERLOCK\nShe would applaud your choice of\nwords. You see how it works?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n55.\n(MORE)\n\n\nThat camera is her get-out-of-jail\nfree card. You have to leave her\nalone. Treat her like royalty,\nMycroft.\nJOHN\nThough not the way she treats\nroyalty.\nSherlock laughs -\n- and as he does there’s a little orgasmic gasp. Everyone\nstartles a little. Sherlock just picks up his phone, glances\nat it.\nON SCREEN TEXT: Good morning, Mr. Holmes.\nJOHN\nWhat was that?\nSHERLOCK\nJust a text.\nJOHN\nBut what was the noise?\nSHERLOCK\nDid you know there were other\npeople after her too. Before you\nsent John and me in there? CIA\ntrained killers, at an excellent\nguess.\nJOHN\nYeah, cheers for that, Mycroft.\nMrs Hudson pipes up from the kitchen.\nMRS HUDSON\nIt’s disgrace, sending your little\nbrother into danger like that.\nFamily’s all we have in the end,\nMycroft Holmes!\nMYCROFT\nOh, shut up, Mrs Hudson!\nSHERLOCK\n(Outraged)\nMycroft!\nJOHN\n(Outraged)\nOi!\nTwo indignant stares, and Mycroft realises he’s crossed a\nline.\nMYCROFT\n(To Mrs Hudson)\nApologies.\nMRS HUDSON\nThankyou!\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n56.\nSHERLOCK (cont'd)\n\n\nSHERLOCK\nThough do, in fact, shut up.\nAnother little orgasmic gasp.\nMRS HUDSON\nOh, it’s a bit rude, that noise,\nisn’t it?\nSherlock absently checks his phone as he continues talking -\nJohn watching him, curiously.\nSHERLOCK\nThere’s nothing you can do for now -\nand nothing she will do, as far I\nunderstand.\nDuring above:\nON SCREEN TEXT: Feeling better?\nSherlock puts the phone down again.\nMYCROFT\nI can put maximum surveillance on\nher.\nSHERLOCK\nWhy bother - you can follow her on\ntwitter. I believe her user name is\nThe Whip Hand.\nMYCROFT\nYes, most amusing - excuse me.\nHe’s now answering his phone, which has been buzzing. He\nsteps away for a whispered conversation.\nJohn has been dying to know:\nJOHN\nWhy does your phone make that\nnoise?\nSHERLOCK\nWhat noise?\nJOHN\nThat noise - the one it just made.\nSHERLOCK\nIt’s a text alert. It means I’ve\ngot a text.\nJOHN\nYour texts don’t usually make that\nnoise.\nSherlock now studying the paper, really not wanting to get\ninto this.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n57.\n\n\nSHERLOCK\nWell. Someone got hold of my phone,\nand for a joke, apparently,\npersonalised their text alert\nnoise.\nJOHN\nSo every time they text you ...\nAnother orgasmic gasp.\nSHERLOCK\nIt would seem so.\nMRS HUDSON\n(From the kitchen, a\nlittle flustered)\nCould you turn that phone down a\nbit, at my time of life.\nHe glances at the phone:\nON-SCREEN TEXT: I’m fine, since you didn’t ask.\nHe lays aside the phone again - pointedly, face down. John,\nlooking at him, pondering. Maybe even smiling a bit.\nJOHN\nI’m just wondering who could have\ngot hold of your phone recently.\nCos it would’ve been in your coat,\nwouldn’t it?\nSHERLOCK\nI leave you to your deductions.\nJOHN\nI’m not stupid, you know.\nSHERLOCK\nWhere do you get that idea?\nHe glances over at Mycroft, just concluding his call.\nMYCROFT\nBond Air is go, that’s decided -\ncheck with the Coventry lot. Talk\nlater.\nMycroft clicking stepping over, phone call done. The moment\nhe clicks.\nSHERLOCK\nWhat else does she have?\n(Off Mycroft’s frown)\nIrene Adler. The Americans wouldn’t\nbe interested in a few compromising\nphotographs, there’s more. A lot\nmore. There’s something big coming -\nisn’t there?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n58.\n\n\nMYCROFT\nIrene Adler is no longer any\nconcern of yours. From now, you\nwill stay out of this.\nSHERLOCK\nOh, will I?\nMYCROFT\nYes, Sherlock, you will. Now if\nyou’ll excuse me, I have a long and\narduous apology to make to a very\nold friend.\nSHERLOCK\nGive her my love.\nHe’s snatched up his violin and plays Mycroft out the door -\nGod Save The Queen.\nMycroft just rolls his eyes - when will he grow up.\nWe cut to just outside the window, pulling back from the\nlittle domestic scene inside.  We can still see Sherlock\nplaying, still hear the music, as we dissolve to:\nINT. 221B BAKER STREET - NIGHT\n90\n90\n... the same window, but now there are CHRISTMAS LIGHTS\naround it, and maybe even a little snow drifting past. And\nthe violin is still playing, but it’s “We Wish You A Merry\nChristmas.”\nInside. Christmas Eve in Baker Street. MRS HUDSON is sitting\nin the chair by the fire, looking happier than we have ever\nseen her. JOHN, wearing a SANTA HAT, is pouring her a cup of\ntea and JEANETTE (a pretty woman we haven’t seen before) is\nserving her a TRAY OF MINCE PIES. SHERLOCK stands on the run,\nserenading her with his VIOLIN.\nHe comes to the end with an elaborate flourish and a deep\nbow.\nMRS HUDSON\nOh, that was lovely, Sherlock, just\nlovely. But I wish you’d worn the\nantlers.\nSHERLOCK\nSome things, Mrs. Hudson, are best\nleft to the imagination.\nLestrade pipes up from the kitchen - he’s sitting there with\na drink, and he’s probably had a few.\nLESTRADE\nNah, I’ve got photoshop on my\ncomputer - hours of fun after a day\nof Sherlock.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n59.\n\n\nJOHN\nYeah.\n(Off Sherlock’s look)\nSorry.\nSHERLOCK\nStill here, are you?  I had no idea\nwe had so much gin. No thank you,\nSarah.\nHe’s speaking Jeanette who’s offering him the tray of mince\npies. The room drops a degree.\nJohn, appears next to Jeanette, arm round her.\nJOHN\nHe’s not good at names.\nSHERLOCK\nNo, hang on, I know this. Sarah was\nthe doctor one, then there was the\nspotty one, the nose one, and who\ncame after the boring teacher?\nJEANETTE\nNobody.\nSHERLOCK\nJeanette! Process of elimination.\nNow bustling through the doors, Molly Hooper, with big\nshopping bags full of presents.\nMOLLY\nHello everyone, sorry, hello. It\nsaid on the door, just to come up.\nSHERLOCK\n(Under his breath)\nOh dear Lord.\nMRS HUDSON\nMolly, dear, in you come.\nJOHN\nHello, Molly!\nJEANETTE\nHello, Molly.\nLESTRADE\nHello, Moll -\nSHERLOCK\nIs everyone going to say hello to\neveryone??\nMOLLY\nAre we having a Christmas drinkies\nthen?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n60.\n\n\nSHERLOCK\nThere’s no stopping them.\nApparently.\nSherlock is now at this desk, busying himself.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n60A.\n\n\nMRS HUDSON\nIt’s the one day a year the boys\nhave to be nice to me. It’s almost\nworth it.\nSHERLOCK\nJohn, this counter’s stuck.\n(He’s pointing to John’s\nlaptop)\nOn your blog, it’s still 1895.\nJOHN\nOh no - Christmas is cancelled.\nSHERLOCK\nAnd you’ve got a photograph of me\nin that hat!\nOn John’s laptop screen, a photo of Sherlock in the\ndeerstalker - illustrating a story called “The Six\nThatchers.”\nJOHN\nPeople like the hat.\nSHERLOCK\nNo they don’t. What people??\nMOLLY\nHow’s the hip?\nMRS HUDSON\nAtrocious, thanks for asking.\nMOLLY\nOh, I’ve seen worse. But then, I do\npost-mortems.\n(Colours)\nOh God, sorry, I just - oh!\nSHERLOCK\nDon’t make jokes, Molly.\nMOLLY\nNo. sorry.\n(To Lestrade)\nDidn’t expect to see you - I\nthought you were going to Dorset\nfor Christmas.\nLESTRADE\nFirst thing tomorrow, me and the\nwife. Back together, all sorted.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n61.\n\n\nSHERLOCK\nNo. She’s sleeping with a PE\nteacher.\nMOLLY\n... and John, I hear you’re off to\nyour sister’s, is that right?\nSherlock was complaining. Saying.\nJOHN\nFirst time ever. She’s cleaned up\nher act, she’s off the booze.\nSHERLOCK\nNo.\nJOHN\n... shut up, Sherlock.\nSHERLOCK\nI see you’ve got a new boyfriend,\nMolly, and you’re serious about\nhim.\nMolly: instantly blushing.\nMOLLY\n... What? Sorry, what?\nSHERLOCK\nAnd in fact, you’re going to see\nhim this very night and deliver him\na present.\nJOHN\nOh, take a day off!\nLESTRADE\nShut up and have a drink.\nSHERLOCK\nBut surely you’ve noticed the top\npresent in the bag.\nHe’s pointing to a splendidly wrapped present, in red\nwrapping paper.\nSHERLOCK\nPerfectly wrapped, with a bow,\nwhereas the others are all slapdash\nat best. It’s for someone special\nthen. The shade of red echoes her\nlipstick - either an unconscious\nassociation, or one she’s\ndeliberately trying to encourage.\nEither way, Miss Hooper has love on\nher mind.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n62.\n(MORE)\n\n\nThat she’s serious about him, is\nclear from the fact she’s giving\nhim a Christmas gift at all - that\nalways suggests long term hopes,\nhowever forlorn - and the fact that\nshe’s seeing him tonight is evident\nfrom her make up and clothing.\nShe’s obviously trying to\ncompensate for the size of her\nmouth and breasts -\nAs he speaks he’s picked up the parcel, taken a look -\n- and now freeze in the closest he gets to embarrassment. The\nlabel says Sherlock. An aching silence.\nEveryone avoiding looking at anyone - cos everyone saw this\ntrain crash coming.\nFinally:\nOn Molly - so discomforted, almost tearful.\nMOLLY\nYou always say such horrible\nthings. Every time, you’re just so\nmean, always, always...\nTrain crash now getting worse. No one can even look at\nSherlock now.\nOn Sherlock: and even he - perhaps for the first time ever -\nis getting it. He glances round to the others - no help there\n- and is about to step away...but no. He can do better! He\nalmost has to brace himself, but ...\nSHERLOCK\nI’m sorry. Forgive me.\nJohn, Mrs Hudson, Lestrade - just staring. What? That’s new,\nwhat??\nSherlock touches Molly’s arm.\nSHERLOCK\nMerry Christmas, Molly Hooper.\nAnd he leans in and - a little stiff, a little formal, but\nmeaning it - kisses her on the cheek.\nOn John watching - almost smiling, almost proud. Sherlock\nHolmes, being human.\nSherlock straightens up from Molly, and she’s just staring at\nhim. A moment of kindness - the first one ever. She opens\nhermouth to speak, but before she can -\n- an orgasmic gasp (Sherlock’s phone.)\nMolly’s hand flies to her mouth.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n63.\nSHERLOCK (cont'd)\n\n\nMOLLY\nNo, that wasn’t - I didn’t -\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n63A.\n\n\nSHERLOCK\nNo, it’s fine, it was me.\nLESTRADE\nMy God, really?\nSHERLOCK\nMy phone.\nHe’s pulled his phone from his jacket, now looks at the text.\nON-SCREEN TEXT: Mantelpiece.\nJOHN\nFifty-seven.\nSHERLOCK\nSorry, what?\nSherlock is looking over at the Mantelpiece. There’s a tiny\nlittle red parcel there, with a bow on it.\nJOHN\nFifty-seven of those texts - just\nthe ones I’ve heard.\nSHERLOCK\nHow thrilling that you’ve counted.\nSherlock is now examining the little parcel. A bow on it.\nRed. (NB. It’s not identical to Molly’s parcel, but clearly\nthe same set of impulses went into it.)\nQuick flash: Irene’s lipsticked mouth - the same shade as the\npaper.\nSHERLOCK\nExcuse me!\nNow he’s striding through the kitchen, heading for his room.\nJOHN\nWhat’s wrong? Sherlock?\nSHERLOCK\nI said, excuse me!\nJOHN\nDo you ever reply?\nBut he’s gone.\nINT. SHERLOCK’S BEDROOM - NIGHT\n91\n91\nSherlock now ripping the wrapping paper off to reveal -\n- Irene’s leopard skin camera-phone.\nHe stares at it! No! Why?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n64.\n\n\nAn orgasmic gasp. He checks his phone.\nON-SCREEN TEXT: Merry Christmas, Mr. Holmes.\nINT. MYCROFT’S STUDY - NIGHT\n92\n92\nMycroft, in a leather armchair, in a cold and lofty study, in\nhis cold and lofty home.\nMYCROFT\nOh dear Lord, we’re not going to\nhave Christmas phone calls now, are\nwe? Have they passed a new law?\nINT. SHERLOCK’S BEDROOM - NIGHT\n93\n93\nOn SHERLOCK, sitting on his bed, on the phone. We intercut.\nSHERLOCK\nI think you’re going to find Irene\nAdler tonight.\nMYCROFT\nWe already know where she is. As\nyou were kind enough to point out,\nit hardly matters.\nSHERLOCK\nNo. I think you’re going to find\nher dead.\nAs he says this he turns to see -\n- JOHN, leaning in the doorway. Clearly been listening.\nSherlock instantly snaps the phone off, stands, looks coldly\nat John. Doesn’t like being interrupted.\nJOHN\nYou okay?\nSHERLOCK\nYes.\nAnd Sherlock steps forward and closes the door in John’s\nface.\n"
    },
    {
        "scene": "EXT. BARTS - NIGHT94\n94\nEstablisher of BARTS by night. Still a little snow drifting\nthrough frame.\nCAPTION:\nCHRISTMAS DAY 2 AM.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n65.\n\n\nINT. BARTS/CORRIDOR - NIGHT\n95\n95\nA long, bleak, cold corridor. Marching along it, towards us,\nMYCROFT and SHERLOCK.\nINT. MORGUE - NIGHT\n96\n96\nA BODY on the the slab, covered, ready to be identified.\nMOLLY waiting there. Now SHERLOCK and MYCROFT coming into the\nroom.\nMYCROFT\nThe only one who fitted the\ndescription. Had her taken here,\nyour home from home.\nSHERLOCK\nYou didn’t need to come in, Molly.\nMOLLY\nIt’s okay, everybody else was busy\nwith ... Christmas.\nShe winces, again giving away too much of her lonely life.\nShe’s pulling back the sheet now.\nMOLLY\nI’m afraid her face is a bit sort\nof bashed, it might be a little bit\ndifficult.\nSherlock and Mycroft look coldly down. (We don’t see.)\nMYCROFT\nIt’s her, isn’t it?\nSHERLOCK\nShow me the rest of her.\nMolly hesitates, then pulls back the rest of the sheet.\nSHERLOCK\n(Looking at her)\nIt’s her.\nHe turns, walks out.\nMYCROFT\nThank you, Miss Hooper.\nMOLLY\nWho is she? How did Sherlock\nrecognise her from ... not her\nface.\nOn Mycroft - he’s been pondering the same thing. Doesn’t\nanswer, just turns on his heel.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n66.\n\n\nINT. BARTS/CORRIDOR - NIGHT\n97\n97\nSHERLOCK, standing staring out of the window at the end of\nthe corridor, watching the snow fall. He doesn’t look sad -\njust faintly preoccupied.\nMYCROFT appears next to him, holds up a cigarette, offering\nit to him.\nMYCROFT\nJust the one.\nSHERLOCK\nWhy?\nMYCROFT\nMerry Christmas.\nSherlock smiles, takes it. Mycroft starts lighting it for\nhim.\nSHERLOCK\nSmoking indoors. Isn’t there one of\nthose law things?\nMYCROFT\nWe’re in a morgue - there’s only so\nmuch damage you can do. How did you\nknow she was dead?\nSHERLOCK\nShe had an item in her possession -\none she told me her life depended\non. She chose to give it up.\nMYCROFT\nWhere is this item now?\nSherlock doesn’t answer. He’s looking down the corridor - at\nthe far, three people have emerged from the mortuary. A\nMIDDLE-AGED COUPLE, and an OLDER WOMAN. They’re all clutching\neach other, sobbing. Clearly they have also had some bad\nnews. A mortuary attendant stands at a respectful distance.\nSherlock regards them, clinically.\nSHERLOCK\nLook at them. They all care so\nmuch. Do you ever wonder if there’s\nsomething wrong with us?\nMYCROFT\nAll lives end, all hearts are\nbroken. Caring is not an advantage,\nSherlock.\nThat last word, just a little pointed. Like a gentle,\nbrotherly warning.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n67.\n\n\nSherlock just sucks at his cigarette. Then frowns at it.\nSHERLOCK\nThis is low tar.\nMYCROFT\nWell you barely knew her.\nSherlock gives an abrupt little laugh. Then starts heading\naway down the corridor. As he goes -\nSHERLOCK\nMerry Christmas, Mycroft.\nWe hold on Mycroft, framed against the window, the snow, and\nthe dark. Such a cold figure.\nMYCROFT\nAnd a happy new year.\nAs Sherlock’s footsteps echo away, Mycroft already has his\nphone out, dialling. Now the phone is being answered.\nMYCROFT\nHe’s on his way. Have you found\nanything?\nINT. 221B BAKER STREET - NIGHT\n98\n98\nTurning into close-up, phone at his ear, JOHN. We now\nintercut.\nJOHN\nNo. Did he take the cigarette?\nMYCROFT\nYes.\nJOHN\nShit.\n(Turns, calls)\nHe’s coming. Ten minutes.\nMRS HUDSON now emerging from Sherlock’s bedroom. We also see\nJeanette sitting on the sofa, watching all this, a bit\ncrossly.\nMRS HUDSON\nNothing in the bedroom.\nJOHN\nLooks like he’s clean anyway, we’ve\nchecked all the usual places. Are\nyou sure tonight’s a danger night?\nMYCROFT\nNo, but I never am. You have to\nstay with him.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n68.\n\n\nJOHN\n(Glancing at Jeanette)\nI’ve got plans.\nMYCROFT\nNo.\nMycroft hangs up. John’s face - damn it. Turns to Jeanette.\nJOHN\nLook, I’m really sorry -\nJEANETTE\nYou know, my friends are wrong\nabout you - you’re a great\nboyfriend.\nJOHN\nWell, that’s good, I always thought\nI was great, but -\nJEANETTE\nSherlock Holmes is a lucky man.\nShe’s already getting up, pulling on a coat, so cross -\nJOHN\nJeanette - please -\nJEANETTE\nNo, I mean it. It’s heartwarming,\nyou’ll do anything for him.\nAnd he can’t even tell your\ngirlfriends apart!\nJOHN\nI do things for you. What is it I’m\nnot doing - just tell me, what?\nJEANETTE\nDon’t make me compete with Sherlock\nHolmes.\nJOHN\nI’ll walk your dog. There you go, I\ngive in - I’ll even walk your\nstupid dog for you!\nJEANETTE\n... I don’t have a dog.\nJOHN\nOh, no, that was ... that was the\nlast ... okay.\nJohn’s face: no good way out of this one.\nJEANETTE\nJesus!\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n69.\n\n\nAnd she storms away down the stairs.\nJOHN\n(Calling after her)\nI’ll phone you.\nJEANETTE\nNo.\nJOHN\nOkay.\nMRS HUDSON\nThat really wasn’t very good, was\nit, dear?\nINT. 221B BAKER STREET - NIGHT\n99\n99\nJOHN sitting by the fire. Glass of brandy in hand, trying to\nconcentrate on a book. But really, he’s waiting.\nOutside some drunken revellers are singing “God Rest Ye Merry\nGentlemen.” Distant, lonely, eerie.\nWe hear the door. John looks round.\nSHERLOCK, standing in the doorway, sombre.\nJohn, relieved to see him, hiding it.\nJOHN\nHi. You okay?\nSherlock reflects for a moment. He scans around the room - a\nforensic sweep of a look.\nSHERLOCK\nHope you haven’t messed up my sock\nindex this time!\nAnd we hear his bedroom door bang!\nOh JOHN: damn! And over this we hear a soaring sad melody,\nbeing played on a violin...\nINT. 221B BAKER STREET - DAY\n100\n100\nSHERLOCK, in his DRESSING GOWN, is playing this sweetest\nsaddest tune on his VIOLIN. He stands at the window, focussed\non the music. JOHN is pottering about the flat - putting on\nhis coat, clearly about to go out. MRS HUDSON is clearing\naway plates from where John and Sherlock have been eating.\nJohn’s plate is cleared, Sherlock’s is untouched.\nMrs Hudson pointedly shows the plate to John as she heads to\nthe kitchen. He hasn’t eaten again.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n70.\n\n\nMRS HUDSON\nLovely tune. Haven’t heard that one\nbefore, Sherlock.\nSherlock stops for a moment, makes a mark on sheet of\nmanuscript.\nJOHN\nAre you composing?\nSHERLOCK\nHelps me think.\nThe sad, haunting tune continues.\nJOHN\nWhat are you thinking about?\nAnd a discordant note from Sherlock - he throws down the\nviolin, strides over to where John’s laptop stands open at\nhis desk. He’s pulled from his dressing gown pocket, Irene’s\nleopard skin phone.\nSherlock has pulled up John’s blog page. The counter still\nstands at 1895.\nSHERLOCK\nYour blog counter - it’s still\nstuck at 1895.\nJOHN\nYeah - it’s faulty, I can’t seem to\nfix it.\nSHERLOCK\nFaulty, or you’ve been hacked, and\nit’s a message.\nOn the leopard skin phone, the screen:\nI AM\n[] [] [] []\nLOCKED\nIn the four empty boxes, he enters 1895.\nShe screen flashes red, and\nWRONG PASSCODE.\nTWO ATTEMPTS REMAINING.\nSHERLOCK\nNo, it’s just faulty.\nSherlock’s face - damn it!\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n71.\n\n\nHe heads back to his violin, picks it starts playing again.\nThat same haunting tune.\nJOHN\nOkay. Going out for a bit.\nSherlock ignores him, carries on that sad, sad tune. But his\nface: unreadable.\nJohn, watching him a moment. What’s he thinking, what’s he\nfeeling. No clue. He starts towards the stairs, passes Mrs\nHudson. On impulse, he pulls her aside.\nJOHN\nHas he ever had ... anyone.\nGirlfriend, boyfriend, any kind of\nrelationship?\nMRS HUDSON\nI don’t know.\nJOHN\nHow can we not know?\nMRS HUDSON\nHe’s Sherlock. We’ll never know\nwhat’s going on in that funny old\nhead.\n"
    },
    {
        "scene": "EXT. BAKER STREET - DAY101\n101\nJohn, coming out the door of 221B. A beautiful woman, turns\nas he passes.\nBEAUTIFUL WOMAN\n(From off)\nJohn?\nJOHN\n(Turning)\nHello.\n(Registers that he doesn’t\nknow her)\nHello?\n(Registers that she’s\nbeautiful and he’d better\nstart making an effort)\nHello!\nBEAUTIFUL WOMAN\nSo any plans for New Year tonight?\nJOHN\nWell. Nothing fixed. Nothing I\ncouldn’t heartlessly abandon. Any\nideas?\nBEAUTIFUL WOMAN\nOne.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n72.\n\n\nA BIG BLACK CAR is sliding up the kerb between them. She\nsteps over, goes to one of rear doors, and holds it open for\nhim.\nJohn sags. Oh!\nWe cut to a higher shot of John now climbing into the car.\nThe POV of:\nSHERLOCK, watching from the window.\nOn John, now climbing into the car.\nJOHN\nYou know, Mycroft could just phone\nme! If he didn’t have some bloody\nstupid power complex!\n"
    },
    {
        "scene": "EXT. BATTERSEA POWER STATION - DAY102\n102\nThe big black car now rolls to halt outside the ruined old\nbuilding.\nOn JOHN, staring through the window at his destination.\nJOHN\nSeriously?\nINT. BATTERSEA POWER STATION/WALKWAY - DAY\nJOHN and the BEAUTIFUL WOMAN now heading along a suspended\nwalkway together, John looking around the huge, abandoned\nbuilding.\nJOHN\nCouldn’t we just go to a cafe?\nSherlock doesn’t follow me\neverywhere!\nBEAUTIFUL WOMAN\nThrough here.\nShe’s now gesturing towards a door. John duck through it.\nBEAUTIFUL WOMAN\n(Into phone)\nHe’s on his way. You were right -\nhe thinks it’s Mycroft.\nINT. ABANDONED CONTROL ROOM - DAY\n103\n103\nJohn, waiting. Face sombre, distracted. A movement from off -\nsteps approaching in the gloom.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n73.\n\n\nJOHN\nHe’s writing sad music. Doesn’t\neat, barely talks, except to\ncorrect the television. I’d say he\nwas heartbroken, but he’s Sherlock,\nhe does all that anyway...\nHe’s turned to look at Mycroft -\n- and just stares.\nBecause it isn’t Mycroft, it’s IRENE ADLER. (As dramatic and\nmysterious as we can get away with - cape and hood?)\nIRENE ADLER\nHello, Dr. Watson.\nA silence. John, just appalled, just for a moment, wordless.\nThen:\nJOHN\nTell him you’re alive.\nIRENE ADLER\nHe’d come after me.\nJOHN\nI’ll come after you if you don’t.\nIRENE ADLER\nI believe you.\nJOHN\nYou were dead on a slab. It was\ndefinitely you!\nIRENE ADLER\nDNA tests are only as good as the\nrecords you keep.\nJOHN\nOh, and I bet you know the record-\nkeeper.\nIRENE ADLER\nI know what he likes. And I needed\nto disappear...\nJOHN\nThen how come I can see you - and I\ndon’t even want to!\nIRENE ADLER\nI made a mistake. I sent Sherlock\nsomething for safe-keeping, now I\nneed it back. So I need your help.\nJOHN\nNo.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n74.\n\n\nIRENE ADLER\nIt’s for his own safety.\nJOHN\nSo’s this - tell him you’re alive.\nIRENE ADLER\nI can’t.\nJOHN\nFine, I’ll tell him. And I still\nwon’t help you.\nA silence. Then she pulls out her phone (NOT the leopard skin\ncamera phone, just her regular mobile.)\nIRENE ADLER\nWhat do I say?\nJOHN\nWhat do you normally say? You\ntexted him a lot.\nIRENE ADLER\nJust the usual stuff.\nJOHN\nThere is no “usual” in this case.\nIRENE ADLER\n“Good morning”. “I like your funny\nhat”. “I’m sad tonight, let’s have\ndinner.” “You looked sexy on\nCrimewatch, let’s have dinner.”\n“I’m not hungry - let’s have\ndinner.”\nJOHN\nYou flirted with Sherlock Holmes?\nIRENE ADLER\nAt him. He never replies.\nJOHN\nSherlock always replies, to\neverything. He can’t help himself -\nhe’s Mr. Punchline. He’ll outlive\nGod, trying to have the last word.\nIRENE ADLER\nDoes that make me special?\nJOHN\nI don’t know. Maybe.\nIRENE ADLER\nAre you jealous?\nJOHN\nFor God’s sake. We’re not a couple.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n75.\n\n\nIRENE ADLER\nYes, you are.\n(Sends text - shows John\nthat it’s sent)\n“I’m not dead. Let’s have dinner.”\nJOHN\n... Who the hell knows about\nSherlock Holmes, but for the\nrecord, if anyone out there still\ncares, I’m not actually gay.\nIRENE ADLER\nI am. And look at us both.\nA moment. And they both smile. Now laughing - a shared moment\nof warmth at the absurdity of their conversation. Cut short\nby:\nFrom the shadows, a familiar ORGASMIC GASP. The text has\narrived.\nIrene and John startle, turn, look into the shadows of the\nancient room\n-\n- is there just an outline standing there, black against\nblack.\nAnd before they can be sure, the scrape of a foot, and\nfootsteps heading rapidly away into the dark.\nJohn, stricken now, makes to follow. Irene stops him.\nIRENE ADLER\nI don’t think so - do you?\n"
    },
    {
        "scene": "EXT. BAKER STREET - EVENING104\n104\nSherlock heading along the street.\nTight on his face now - again, just blank, unreadable. What’s\ngoing on in that head?\nNow at the door to 221B. Stops. Stares. Oh!\nSHERLOCK VISION: the door is standing minutely open. Zooming\nin super close: tiny SPLINTERS and GASHES in the paintwork of\nthe door, freshly made. Has someone forced their way in?\nSherlock, cold as ice now, so alert. He steps through the\ndoor.\nINT. DOWNSTAIRS HALLWAY AT 221B - EVENING\n105\n105\nSherlock now coming carefully through the door, scanning.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n76.\n\n\nSHERLOCK VISION: Mrs Hudson’s door, standing open. Zooming to\n- Mrs Hudson’s bucket of cleaning things, standing abandoned\nin the corner (an disinfectant spray bottle is prominent, but\nnot featured.) Zooming to the stairs now. Super close - new\nblack scuff mark on the skirting\nVERY FAST FLASHBACK: Two pairs of black shoes climbing\nstairs, Mrs Hudson’s feet between them - she’s clearly\nstruggling. One of the black shoes scuffs against the\npaintwork.\nSHERLOCK VISION: Now zooming fast on a tiny tear in the\nwallpaper.\nVERY FAST FLASHBACK: Mrs Hudson’s hand trying to cling to the\nwall, her fingernail tears the paper...\nClose on Sherlock’s face. Full alert now - bad news for\nsomeone.\nINT. 221B BAKER STREET - EVENING\n106\n106\nMRS HUDSON sitting terrified on a chair. NEILSON (one of the\nAmericans) has a GUN leveled right at her head. He has two\nblack suited goons - TRANTER and a new one - standing by the\nfireplace.\nAnd now SHERLOCK comes strolling through the door, cool as\nanything, hands clasped behind him, cool as anything - like\nPrince Charles on an official visit.\nMrs Hudson gives a little whimper as she sees him.\nSHERLOCK\nPlease don’t snivel, Mrs. Hudson -\nit does nothing to impede the\nflight of a bullet. What a tender\nworld that would be.\nMRS HUDSON\nSorry, Sherlock.\nOn Sherlock, as his eyes flick to:\nSHERLOCK VISION: we zoom in a red mark on Mrs Hudson’s face.\nShe’s been slapped, hard. Zooming in further - there is a\nlittle trickle of blood in the centre of the bruise.\nWe pans super fast to Neilson’s hand holding the gun. Now\nzooming in on the ring on his finger. There’s a tiny smear of\nblood.\nNEILSON\nI believe you have something that\nwe want, Mr. Holmes.\nSHERLOCK\nThen you should ask for it.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n77.\n\n\nSherlock has stepped forward to Mrs Hudson. Gently he pushes\none of her sleeves up - blotches on her arm. Finger marks\nwhere she’s been tightly gripped. Now his fingers go to where\nthere’s a rip in her blouse - he’s almost tender. She’s been\nroughed up - and now she’s shaking like a leaf.\nNEILSON\nI’ve been asking this one - she\ndoesn’t seem to know anything. But\nyou know what I’m asking for, don’t\nyou, Mr. Holmes?\nSherlock’s gaze slams on to Neilson - a stare like cold blue\nlasers.\nSHERLOCK\nI believe I do.\nOn Neilson - and now swirling round him, words start swirling\nround him. CARTOID ARTERY. RIBS. SKULL. LUNGS. EYES. THROAT.\nThe word ARTERY appears over several areas on his body.\nSherlock Holmes, choosing a target.\nNeilson levels his gun at Sherlock.\nSHERLOCK\nFirst, send your boys away.\nNEILSON\nWhy?\nSHERLOCK\nI dislike being outnumbered. It\nmakes for too much stupid in the\nroom.\nNEILSON\nYou two, go to the car.\nThey start moving.\nSHERLOCK\nThen get in the car and drive away.\nDon’t try to trick me - you know\nwho I am, it doesn’t work.\nThe two men leave.\nSHERLOCK\nNext, stop pointing that gun at me.\nNEILSON\nSo you can point a gun at me?\nSHERLOCK\nI’m unarmed.\nNEILSON\nYou don’t mind if I check?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n78.\n\n\nSHERLOCK\nI insist.\nNeilson steps forward, and with his gun still trained on him,\nhe starts briskly and efficiently frisking with his other\nhand. As he bends to his task, Sherlock helpfully raises his\nhands over his head -\n- we pan up with them and now see what he’s been concealing\nbehind him. The SPRAY BOTTLE from Mrs Hudson’s cleaning\nbucket, held in his hand.\nHe glances at Mrs Hudson over Neilson’s shoulder. She’s seen\nthe aerosol gives him an impish smile - he just rolls his\neyes at the stupidity of goons these day -\n- and as Neilson straightens up, he blasts him right in the\nface with the spray bottle. Neilson screams and -\nSHERLOCK\nMoron!\n- Sherlock gives him a cracking headbutt!\n"
    },
    {
        "scene": "EXT. BAKER STREET - EVENING107\n107\nJohn is just climbing out of the big black car -\n- to see a NOTE pinned to the door of 221b. In Sherlock’s\nhandwriting it says:\nCRIME IN PROGRESS. PLEASE DISTURB.\n- and John is already running.\n108\nINT. 221B BAKER STREET - EVENING\n108\nJohn comes bursting through the door of the flat to discover -\nNeilson, now handcuffed to chair, with gaffer tape across his\n* mouth.\nSherlock, pacing, with phone at his ear.\nJOHN\nWhat’s going on? What the hell is\nhappening??\nSHERLOCK\nMrs. Hudson has been slapped by an\nAmerican - I’m restoring balance to\nthe universe.\nNow sees Mrs Hudson, on the sofa, still recovering.\nJOHN\nOh, my God, Mrs Hudson, are you all\nright? Jesus, what did they do?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n79.\n\n\nMRS HUDSON\nOh, I’m being so silly.\nAnd she’s sobbing against him now.\nSHERLOCK\nDownstairs, take her downstairs,\nlook after her.\nJOHN\n(Helping her to the door)\nAre you going to explain what’s\nbeen going on here?\nSHERLOCK\nI expect so, now go!\n(Into phone)\nLestrade! We’ve had a break-in at\nBaker Street. Send your least\nirritating officers, and an\nambulance.\n(An ambulance?)\nNo, no, we’re fine. But the burglar\nseems to have got himself badly\ninjured.\nOn Neilson’s eyes, widening. What. What?? (Lestrade is\nasking, what do mean, badly injured?)\nSherlock is looking speculatively at his prisoner.\nSHERLOCK\nOh, you know. Few broken ribs,\nskull fracture, possibly a\npunctured lung - he fell out the\nwindow.\nAnd he snaps his phone shut savagely shut -\n- and looks down at Neilson like the wrath of God...\nOn Neilson’s face. Oh shit.\nINT. MRS HUDSON’S KITCHEN - EVENING\n109\n109\nJohn and Mrs Hudson, as John cleans her wound -\n- and there is the sound of breaking glass, then a tremendous\ncrash from outside the window next to them. Something has\nlanded with a huge clamour, but through the net curtains, we\ncan’t quite see what’s happened.\nMRS HUDSON\nThat was right on my bins!\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n80.\n\n\n"
    },
    {
        "scene": "EXT. BAKER STREET - NIGHT110\n110\nAn ambulance is pulling away from 221B. We pan with it,\ntaking as to a shot of LESTRADE and SHERLOCK, face to face.\nLESTRADE\nAnd exactly how many times did he\nfall out of that window?\nSHERLOCK\nIt was all a bit of a blur,\nDetective Inspector. I lost count.\nINT. MRS HUDSON’S KITCHEN - NIGHT\n111\n111\nJOHN sitting with a still shaky Mrs Hudson as Sherlock\nenters.\nJOHN\nShe’ll have to sleep upstairs in\nour flat tonight - we need to look\nafter her.\nSHERLOCK\nOf course, but she’s fine.\nJOHN\nNo, she’s not, look at her. She’s\ngot to take some time away from\nBaker Street - she can go and stay\nwith her sister. Doctor’s orders.\nSHERLOCK\nDon’t be absurd.\nJOHN\nShe’s in shock, for God’s sake! And\nall for that bloody stupid camera-\nphone - where is it anyway?\nSHERLOCK\nIn the safest place I know.\nHe goes to Mrs. Hudson, puts out his hand - and she pulls the\nleopard skin CAMERA-PHONE from inside her blouse and hands it\nto him.\nMRS HUDSON\nYou left it in the pocket of your\nsecond best dressing gown, you\nclot. Managed to sneak it out when\nthey thought I was having a cry.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n81.\n\n\nSHERLOCK\nThank you.\n(Tosses the camera-phone\nin his hand, slips it in\nhis pocket)\nShame on you, John Watson.\nJOHN\n... Shame on me?\nSHERLOCK\nMrs. Hudson? Leave Baker Street??\nHe puts his arms round her, gives her the biggest hug.\nSHERLOCK\nEngland would fall.\nINT. SHERLOCK’S BEDROOM - NIGHT\n112\n112\nOn MRS HUDSON, peacefully asleep in Sherlock’s bed. We pan\nfrom her to bedside digital clock.\n11.59.\nINT. 221B BAKER STREET - NIGHT\n113\n113\nJohn slumped in one of the armchairs. The door bangs,\nSherlock now entering. He’s been out somewhere.\nJOHN\nSo where is it now?\nSHERLOCK\nWhere no one will look.\nJOHN\nWhatever’s in that camera, it’s\nmore than just pictures.\nSHERLOCK\nYes, it is.\nHe’s crossed to the window, now looking out at the night. He\npicks it up his violin, toying with it, thoughtfully.\nJOHN\nSo. She’s alive then. How are we\nfeeling about that?\nAnd from outside, there are cheers, and fireworks going off.\nSHERLOCK\nHappy New Year, John.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n82.\n\n\nJOHN\nDo you think you’ll be ... seeing\nher again?\nSherlock just looks at him - he overheard that conversation\nand they both know it. But he doesn’t answer the question -\nor maybe he does. Still looking at John, he tucks the violin\nunder his chin, and starts to play.\nShould auld acquaintance be forgot,\nAnd never brought to mind?\nShould auld acquaintance be forgot,\nAnd days of old lang syne!\nAs Sherlock plays he’s turned to the window. Looking out, he\nhas just the faintest of smiles.\n"
    },
    {
        "scene": "EXT. LONDON STREETS/OUTSIDE PUB  - NIGHT114\n114\nThe same song is being taken up in a pub - from outside we\ncan hear the revellers singing, as a caped, hooded figure\nheads quickly past.\nCloser: IRENE ADLER, heading who knows where...\nShe stops, hearing a chime. Pulls out her phone - and stares\nin surprise at it.\nON-SCREEN TEXT: Happy New Year. SH.\nShe smiles - incredulous, maybe a bit thrilled - then heads\non.\nDISSOLVE TO:\n"
    },
    {
        "scene": "EXT. LONDON STREETS/OUTSIDE - DAY115\n115\nThe same street - but now it’s a blazing hot day. People in\nshorts and tee-shirts, ice cream vans. Summer has arrived.\n"
    },
    {
        "scene": "EXT. BARTS - DAY116\n116\nEstablisher of Barts.\nINT. BARTS LAB - DAY\n117\n117\nSHERLOCK is working in Barts lab, Molly assisting.\nSherlock is working at an X- ray machine. On the screen we\ncan see Irene’s camera-phone, its workings exposed.\nMOLLY\nIs that a phone?\nSHERLOCK\nA camera-phone.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n83.\n\n\nMOLLY\nAnd you’re X-raying it?\nSHERLOCK\nYes, I am.\nSherlock now examining the X-Rayed phone - close on some\ndetails several black shapes, positioned around the phone’s\nworkings. What are those?\nMOLLY\nWhose phone is it?\nSHERLOCK\nA woman’s.\nMOLLY\n(Instant pang)\nYour girlfriend?\nSHERLOCK\nYou think she’s my girlfriend\nbecause I’m X-raying her\npossessions?\nMOLLY\n(A slightly guilty\nstartle)\nWe all do silly things!\nShe scuttles away, not able to meet his eye\n-- but that idea seems to impact on Sherlock.\nSHERLOCK\nYes! They do, dont they -\nvery silly.\nHe’s pulled the camera-phone from inside the X-Ray -\nSHERLOCK\nShe sent this to my address - and\nshe loves to play games.\nMOLLY\n(instantly worried)\nShe does?\nIgnoring her, he’s typing in a new attempt at the entry code.\nI AM\n[2] [2] [1] [B]\nLOCKED.\nThe screen flashes\nWRONG PASSCODE\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n84.\n\n\n1 MORE ATTEMPTS\nSherlock’s face: damn!\nINT. 221B BAKER STREET - DAY\n119A\n119A\nOn SHERLOCK - just arrived home, now tensing. Something’s\nwrong. Looks around, scanning.\nSherlock’s POV. The kitchen - everything seems normal.\nExcept ...\nSherlock vision: zooming in the window. It’s slightly open.\nThe glass in front of the catch has been discreetly broken.\nSomeone’s got in.\nHe sniffs now.\nFLASHBACK: Irene’s red lips.\nHe now walks quickly to his bedroom, throws open the door.\nINT. SHERLOCK’S BEDROOM - DAY\n119B\n119B\nIRENE ADLER is fast asleep in his bed. She looks tousled, her\nface dirt-streaked. She’s been living rough.\nOn Sherlock’s face: we can read nothing. From off we hear\nJOHN arriving.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n84A.\n\n\nJOHN\n(From off)\nSherlock?\nSHERLOCK\nWe have a client.\nJOHN\n(From off)\nWhat, in your bedroom.\nHe joins Sherlock in the doorway. Sees who it is.\nJOHN\nOh.\nINT. 221B BAKER STREET - DAY\n132\n132\nIRENE - showered now, in one of Sherlock’s dressing gowns -\nis curled in Sherlock’s armchair, sipping some tea.\nSHERLOCK and JOHN are with her.\nSHERLOCK\nWho’s after you?\nIRENE ADLER\nPeople who want to kill me.\nSHERLOCK\nAnd who’s that?\nIRENE ADLER\nKillers.\nJOHN\nWould help if you were a tiny bit\nmore specific.\nSHERLOCK\nSo you faked your death to keep\nahead of them.\nIRENE ADLER\nIt worked for a while.\nSHERLOCK\nExpect you told John you were alive\n- and therefore, told me.\nIRENE ADLER\nI knew you’d keep my secret.\nSHERLOCK\nYou couldn’t.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n85.\n\n\nIRENE ADLER\nBut you did, didn’t you?\n(A teasing smile - then)\nWhere’s my camera-phone?\nJOHN\nNot here, we’re not stupid.\nIRENE ADLER\nThen what you done with it? If\nthey’ve guessed you’ve got it,\nthey’ll have been watching you.\nSHERLOCK\nIf they’ve been watching me,\nthey’ll know I took a safety\ndeposit box at a bank on the\nStrand, a few months ago.\nIRENE ADLER\nI need it.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n85A.\n\n\nJOHN\nOkay, but we can’t just go and get\nit, can we?\n(To Sherlock)\nMolly Hooper? She could pick it up,\ntake it to Barts. One of your\nhomeless network, could bring it\nhere, leave it in the cafe. One of\nthe guys could bring it up the\nback.\nSHERLOCK\nVery good, John - an excellent\nplan, full of intelligent\nprecautions.\nJOHN\nThankyou, why don’t I get straight\non to -\nBut Sherlock has pulled the camera-phone from his pocket.\nJOHN\n... okay.\nINT. 221B BAKER STREET - DAY\n133\n133\nOn the leopard skin CAMERA PHONE. Sherlock, in his armchair,\nhas it in his hand, is examining it.\nSHERLOCK\nSo what do you keep on here. In\ngeneral, I mean.\nIRENE ADLER\nPictures. Information. Anything I\nmight find useful.\nJOHN\nFor blackmail?\nIRENE ADLER\nFor protection. I make my way in\nthe world. I misbehave. I like to\nknow there will be people on my\nside - exactly when I need them to\nbe.\nSHERLOCK\nAnd how do you acquire this\ninformation?\nIRENE ADLER\nI told you - I misbehave.\nSHERLOCK\nBut you’ve acquired something that\nis more danger, than protection. Do\nyou know what it is.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n86.\n\n\nIRENE ADLER\nYes. But I don’t understand it.\nSHERLOCK\nI assumed. Show me.\nShe puts her hand out for the phone - Sherlock affects to\nignore that.\nSHERLOCK\nWhat’s the passcode?\nOne hand with the other, and enters the code -\n- and now frowns.\nIRENE ADLER\nIt’s not working.\nSherlock is already lifting camera-phone from her hand.\nSHERLOCK\nThat’s because it’s a duplicate I\nhad made.\n(Checking the display)\nInto which you just entered the\nnumber 1058. Funny, I thought you’d\nchoose something more specific.\nHe tosses the duplicate aside and produces the real leopard\nskin camera phone from behind a book on the shelf.\nSHERLOCK\nBut thanks anyway.\nHe punches in the number.\nOn the screen.\nIt’s flashing again.\nWRONG PASSCODE\n0 MORE ATTEMPTS\nHe blinks in confusion - looks to Irene, who is smirking at\nhim.\nIRENE ADLER\nIt told you that camera phone is my\nlife. I know when it’s in my hand.\nHe passes it to her.\nSHERLOCK\nYou’re rather good.\nIRENE ADLER\nYou’re not so bad.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n87.\n\n\nJOHN\nHamish.\nThey look at him.\nJOHN\nJohh Hamish Watson. Just if you’re\nlooking for kids names.\nIRENE ADLER\nThere was a man - an MOD official -\nand I knew what he liked. One of\nthe things he liked was showing\noff.\nPasses the phone to Sherlock. A photograph of a computer\nscreen - on it we can see an email.\nIRENE ADLER\nHe told me this email was going to\nsave the world. He didn’t know I\nphotographed it - he was a bit tied\nup at the time.\nOn the screen. The email is headed:\n007 CONFIRMED ALLOCATION\nAnd the content of the email is as follows.\n4C12C45F13E13G60A60B61F34I34J60D12H33K34K\nSherlock takes the camera-phone to his desk, examines now\nbends over it, like he’s trying to drink in every detail.\nIRENE ADLER\nIt’s a bit small on that screen -\ncan you read it?\nSHERLOCK\nYes.\nIRENE ADLER\nCode obviously. I had one of the\ntop cryptographers in the country\nhave a go at this - though he was\nmostly upside down at the time!\nCouldn’t make anything of it. What\ncan you do, Mr. Holmes?\nShe’s at his shoulder now, leaning into him, flirty.\nIRENE ADLER\nGo on - impress a girl!\nAnd impulsively she leans in to kiss his cheek -\n- and time slows down!\nOn Irene, leaning in - glacier speed.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n88.\n\n\nOh John, setting down his teacup - barel moving.\nOn Sherlock - he alone is normal speed, twitching, thinking,\nbrain on hyperdrive.\nThe code from the email now swirls on the screen in front of\nhim -\n4C12C45F13E13G60A60B61F34I34J60D12H\n- the letters and numbers spin and dance and re-arrange.\n- on Irene’s lips moving closer, so very slowly -\n- on John’s teacup, with maddening slowness, descending to\nthe saucer -\nSherlock blinking, thinking, frowning, come on, come on!!\nThe letters swirling re-arranging, now in their original\nline. (The following is fast, we don’t hang around - this\nwill take a while to read but should be fluid and zippy on\nscreen.)\nFirst we see the original line:\n4C12C45F13E13G60A60B61F34I34J60D12H\nThen all the letters fade out leaving us with.\n4 12 45 13 13 60 60 61 34 34 60 12\nThen the letters return and the numbers fade leaving us with.\nC  C  F  E G  A  B  F  I  J  D H\nSherlock blink, noticing something\nThe letters rearrange into alphaetical order:\nA B C C D E F F G H I J\nNow the duplicate letters disappear to become\nA B C D E F G H I J\nFrowning, recognising, seen that before.\nIrene’s lips, closer.\nJohn’s teacup descending.\nNow the letters all move slightly, some compressing, some\nspreading out to become.\nABC DEFG HIJ\nNow boxes form around the letters, and we’re zooming out to\nsee -\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n89.\n\n\n- the seating plan of the coach section of a passenger jet.\nNow seat row numbers are appearing next to the rows of\nletters, and we’re streaking down the schematic to the back\nrow - numbered as always 55.\nAnd Sherlock just smiles at that.\nAnd the kiss lands, and teacup chinks into the saucer, and\nSherlock says:\nSHERLOCK\nThere’s a margin for error, but I’m\npretty sure there’s a 747 leaving\nHeathrow at 6.30 tomorrow evening\nfor Baltimore, and apparently it’s\ngoing to save the world. Not sure\nhow that could be true, but give me\na moment, I’ve only been on the\ncase for eight seconds.\nThey just look at him, startled.\nSHERLOCK\nOh, come on, it’s not code, these\nare seat allocations on a passenger\njet. Look! There are no letters\npast J - the width of the plane is\nthe limit. The numbers only appear\nsingly and never in sequence, but\nthe letters have little runs of\nsequence all over place - families\nand couples sitting together. Only\na Jumbo is wide enough to need a\nletter J, or rows past 55, which\nalways require an upstairs section.\nThere’s a row 13, so we can\neliminate the more superstitious\nairlines. The style of the flight\nnumber - zero zero seven -\neliminates a few more, and assuming\na British point of origin, which\nwould be logical given the original\nsource of the information, and\nassuming from the increased\npressure on you lately, that the\ncrisis is imminent, the only flight\nwhich matches all the criteria and\ndeparts within a week, is the 6.30\nto Baltimore tomorrow evening, from\nHeathrow airport.\nAgain just silence. That was alarming fast and clever. For\nthe first time, Irene is just staring at him in a general\nstate of wow!\nSHERLOCK\nPlease don’t feel obliged to tell\nme that was remarkable or amazing.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n90.\n(MORE)\n\n\nJohn has expressed that thought in\nevery possible variant available to\nthe English language.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n90A.\nSHERLOCK (cont'd)\n\n\nIRENE ADLER\nI would have you, on this desk,\nright now, till you begged for\nmercy, twice.\nSHERLOCK\n............. John, could you check\nthose flight schedules, see if I’m\nright?\nJOHN\n... yeah, right, on it, yeah.\nHe potters at a computer. Grateful to be out of the\nconversation.\nSherlock looks back at Irene, still that roasting stare from\na bit too close. He makes a modest flail for dignity.\nSHERLOCK\nNever begged for mercy in my life.\nIRENE ADLER\nTwice.\nJOHN\nYep, you’re right - double-O-seven,\nlicensed to fly.\nOn Sherlock - the words impact on him.\nSHERLOCK\nWhat did you say??\nJOHN\nI said, you’re right.\nSHERLOCK\nNo, after that, what did you say\nafter that??\nJOHN\nDouble-O-seven. Flight double-O-\nseven.\nSherlock distracted now, moving away - something haunting\nhim, chiming in his head.\nOn Irene, watching him, apparently worried -\n- but the camera swoops down behind her, closing on one hand\nheld slightly behind her. She has her phone in her hand and\nis rapidly thumbing a text.\nThe words now running across the screen:\n747 TOMORROW 6.30PM. HEATHROW.\nThe words keep typing as the picture behind them dissolves\nto:\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n91.\n\n\n"
    },
    {
        "scene": "EXT. WESTMINSTER BRIDGE - DAY134\n134\nFrom behind, a MAN heading along. As the words complete,\nthere is the beep of a text arriving. The man stops walking,\npulls out his mobile phone, looks at it -\n- and as he does so, we swoop round in front of him. It’s JIM\nMORIARTY! He reads the text in mounting joy. A mad,\nspreading, grin.\nINT. 221B BAKER STREET - DAY\n135\n135\nOn Sherlock, pacing now, bit frantic, trying to reach for\nsomething\nSHERLOCK\nDouble-O-seven! Double-O-seven.\n(Slaps his head)\nThere’s something! What? What??\n"
    },
    {
        "scene": "EXT. WESTMINSTER BRIDGE - DAY136\n136\nJIM MORIARTY, rapidly texting away.\nON-SCREEN TEXT: Jumbo jet. Dear me, Mr. Holmes, dear me.\nAs Jim, he giggles happily, childishly. He glances up a Big\nBen and the House of Commons - and blows a big raspberry.\nINT. 221B BAKER STREET - DAY\n137\n137\nSherlock still pacing, still frantic.\nSHERLOCK\nLicensed to fly, license to -\nThen it hits him like a physical impact.\nFLASHBACK: Mycroft on the phone, in this very flat.\nMYCROFT\n(Repeating, on a loop)\nBond Air is go, Bond Air is go,\nBond Air is go, Bond Air is go ...\nTracking in on Sherlock’s bemused face. What? What??\nINT. MYCROFT’S STUDY - DAY\n138\n138\nA blackberry on a leather-topped desk. It buzzes, a text\narriving. A hand reaches in, picks it up to read.\nON-SCREEN TEXT: Jumbo jet. Dear me, Mr. Holmes, dear me.\nAnd the camera moves to reveal -\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n92.\n\n\n- Mycroft staring at the text in mounting horror.\nWe’re pulling back from now, a smaller and smaller figure.\nHe’s just received the worst news in the world. Dissolve to:\nThe same pulling back shot, but now Mycroft is sitting in his\nleather armchair, stricken-faced, a brandy in his hand.\nDissolve to:\nThe same pulling back shot. Mycroft, sitting in the chair,\nhis head held in his hands. How the hell is he going to deal\nwith this one.\nINT. 221B BAKER STREET - NIGHT\n139\n139\nSHERLOCK sprawled in his armchair, plucking listlessly at his\nviolin - the same sad tune he composed earlier, but he’s\nprobably unaware of that. Deep, deep, in thought.\nFlashback.\nMYCROFT\nBond Air is go, that’s decided -\ncheck with the Coventry lot. Talk\nlater.\nSherlock frowning, distracted. Blinks, rewinds.\nMYCROFT\nCoventry - Coventry - Coventry -\nCoventry -\nWider shot. Someone’s POV, as Sherlock cogitates.\nOn IRENE leaning in the kitchen doorway, watching him. Her\nface: so sad. For the first time, she looks full of regrets.\nSHERLOCK\nCoventry.\nIRENE ADLER\nNever been, is it nice?\nSherlock looks up a little startled.\nSHERLOCK\nWhere’s John?\nIRENE ADLER\nHe went out - couple of hours ago.\nSHERLOCK\nBut I was just talking to him.\nIRENE ADLER\nHe said you’d do that. What’s\nCoventry got to do with anything?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n93.\n\n\nSHERLOCK\nThere’s a story - possibly not\ntrue. In the second world war, the\nallies knew Coventry was going to\nbe bombed - because they’d broken\nthe Germans code. But they didn’t\nwant the Germans to know they’d\nbroken it, so they let the bombing\nhappen away...\nIRENE ADLER\nHave you ever had anyone?\nSHERLOCK\n... I’m sorry?\nIRENE ADLER\nAnd when I say “had”, I’m being\nindelicate.\nSHERLOCK\nI don’t understand.\nIRENE ADLER\nI’ll be delicate then. Let’s have\ndinner.\nSHERLOCK\nWhy?\nIRENE ADLER\nYou might be hungry.\nSHERLOCK\nI’m not.\nIRENE ADLER\nGood.\nShe’s kneeling by him now, taking his hand. (We note that he\nseems to reciprocate slightly, but a little clumsily.)\nSHERLOCK\nWhy would I want to have dinner, if\nI wasn’t hungry?\nShe’s leaning in close to him - studying his face, hungrily.\nHe’s equally fascinated, maybe a bit more forensic.\nIRENE ADLER\nMr. Holmes ... if it was end of the\nworld, if this was the very last\nnight ... would you have dinner\nwith me?\nOn Sherlock, puzzled. Then there’s a knock at the door.\nMRS HUDSON\n(From off)\nSherlock?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n94.\n\n\nIRENE ADLER\nToo late.\nSHERLOCK\nThat’s not the end of the world,\nthat’s Mrs Hudson.\nShe gives the saddest look, like she knows he’s wrong, and\nmoves away from him.\nThe door is opening - MRS HUDSON. Behind her we can see\nPLUMMER - the man who first took Sherlock to Buckingham\nPalace.\nMRS HUDSON\nSherlock, this man was at the door -\nis the bell still not working?\n(To PLUMMER)\nHe shot it.\nPlummer is already entering the room.\nSHERLOCK\nAre you taking me away again.\nPLUMMER\nYes, Mr. Holmes.\nSHERLOCK\nI decline.\nPLUMMER\nI don’t think you do.\nAnd Plummer has taken a long envelope from inside his jacket,\nnow passes it to Sherlock.\nA puzzled Sherlock slits it open - and falling into his hand\nis -\n- a boarding pass. Flight 007 to BALTIMORE, 18.30.\nHe stares at it. What??\n"
    },
    {
        "scene": "EXT. BAKER STREET - NIGHT140\n140\nSHERLOCK again climbing into the back of a big black car -\nPLUMMER now climbing in next to him.\nThe car starts to pull away. We pan up to IRENE ADLER,\nstanding at the window, watching it go...\nINT. BIG BLACK CAR - NIGHT\n141\n141\nPLUMMER and SHERLOCK in the back. The street lights flashing\nacross their faces. A silence. Then.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n95.\n\n\nSHERLOCK\nThere’s going to be a bomb on a\npassenger jet. And the British and\nAmerican governments know about it.\nAnd rather than expose the source\nof their information they’re going\nto let the plane blow up. Coventry\nall over again. The wheel turns,\nnothing is ever new.\nPLUMMER\n... I read that blog your friend\nwrites about you.\nSHERLOCK\nAnd?\nPLUMMER\nAnd I didn’t expect you to be an\nidiot.\nSilence resumes. Sherlock - just the trace of a frown.\nSomething’s not good here.\nSherlock’s POV. Lights and signs speeding past - we’re\nturning towards HEATHROW.\n"
    },
    {
        "scene": "EXT. AIRPORT - NIGHT142\n142\nWe’re on a remote part of the airfield. A JUMBO JET standing\nby a HANGER. The passenger staircase is in place.\nThe BIG BLACK CAR goes gliding up. Stops next to it. As\nSherlock climbs out he sees -\nNEILSON and his TWO AMERICAN AGENTS standing at the foot of\nthe steps, like they’re there to guide him on to the plane.\nSherlock, walking over to them now.\nSHERLOCK\n(To NEILSON)\nWell you’re looking all better. How\nare you feeling?\nNEILSON\nLike putting a bullet in your\nbrain, sir.\nHe gestures to the steps, for Sherlock to ascend. Sherlock\nstarts heading up.\nNEILSON\nThey’d pin a medal on me, if I did.\nSir.\nSherlock just stops for a moment, registering that. Then\ncarries on up the steps.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n96.\n\n\nINT. JUMBO - NIGHT\n143\n143\nSherlock, looking around.\nThe interior of the plane is darkened, creepy. The only light\nfrom the portholes.\nAs Sherlock’s eyes adjust to the gloom, he realises he’s not\nalone ...\n... all the seats are occupied. Still, motionless figures,\nsitting and slumped. Sherlock steps closer to one of them -\nclicks on the overhead light. And there, in the little\nspotlight, is a a DEAD MAN.\nHe clicks on another light. A DEAD WOMAN.\nAnother light. Yet another DEAD PASSENGER.\nOn Sherlock: even for him, a neck-prickling realisation.\nEveryone on this plane dead. A passenger manifest of corpses.\nAnd then, impossible - a light nearer the front of the plane\nseems to click on by itself. And there’s a familiar voice.\nMYCROFT\nThe Coventry conundrum. What do you\nthink of my solution?\nAnd now a figure is rising from one the front seats, turn to\nface him. Mycroft.\nMYCROFT\nThe flight of the dead.\nSherlock, looking around, collecting himself, regaining his\ncool.\nSHERLOCK\nThe plane blows up in mid-air,\nmission accomplished for the\nterrorists, hundreds of casualties\n... and nobody dies.\nMYCROFT\nNeat, don’t you think? You’ve been\nstumbling round the fringes of this\none for ages - or were you too\nbored to notice the pattern.\nOn Sherlock blinking, remembering\nFLASHBACK: The big, beefy creepy guy, holding his Aunt’s urn.\nCREEPY GUY\nI know human ash!\nFLASHBACK: The two little girls squeezed into the client\nchair.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n97.\n\n\nLITTLE GIRL\nThey wouldn’t let us see Grandad\nwhen he was dead -\nBack on the plane:\nMYCROFT\nWe ran a similar project with the\nGermans a while back - though I\nunderstand one of our passengers\ndidn’t make the flight - ...\nFLASHBACK: Sherlock examining the inexplicable body in the\nboot of the car.\nMYCROFT\nBut that’s the deceased for you -\nlate in every sense of the word.\nSHERLOCK\nHow does the plane fly? Of course,\nunmanned aircraft, hardly new -\nMYCROFT\nIt doesn’t fly, it will never fly.\nThis entire project is cancelled.\nThe terrorist cells have been\ninformed that we know about the\nbomb - we can’t fool them now. We\nhave lost everything. One fragment\nof one email - and months and years\nof planning are finished.\nSHERLOCK\nYour MOD man...\nMYCROFT\nThat’s all it takes. One lonely,\nnaive man, desperate to show off,\nand a woman clever enough to make\nhim feel special ...\nSHERLOCK\nYou should screen your defence\npeople more carefully ...\nMYCROFT\nI’m not talking about the MOD man,\nSherlock, I’m talking about you!\nOn Sherlock. Rocked by that. No.\nMYCROFT\nA damsel in distress. In the end,\nare you really so obvious, because\nthis was textbook! The promise of\nlove, the pain of loss, the joy of\nredemption. Then give him a puzzle\nand watch him dance...\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n98.\n\n\nSHERLOCK\nDon’t be absurd!\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n98A.\n\n\nMYCROFT\nAbsurd? How quickly did you\ndecipher that email for her - the\nfull minute, or were you really\ntrying to impress?\nIRENE ADLER\n(From)\nI think it was less than five\nseconds.\nSherlock looks round. There’s IRENE, by the entrance to first\nclass. NEILSON stands behind her, clearly has just shown her\nup. She’s back in her own clothes - never looked more ice\nqueen. The armour’s back on..\nSherlock staring at her - guarded, unsure. Mycroft, genuinely\npenitent.\nMYCROFT\nAnd I drove you into her path. I’m\nsorry, I didn’t know.\nIRENE ADLER\nMr. Holmes, I think we need to\ntalk.\nSherlock, now striding towards her. Casual and assured now,\nback to his old stuff.\nSHERLOCK\nI think so too. There are a number\nof aspects I’m still not completely\nclear on -\nIRENE ADLER\nNot you, junior, you’re done now.\nAnd she simply walks past him, goes to Mycroft. She produces\nher leopard skin camera-phone, tosses it in her hand.\nIRENE ADLER\nThere’s more - loads more. And if\nyou like, I’ll keep on proving\nthat. You have no idea how much\nhavoc I can cause, and exactly one\nway to stop me.\nOn Mycroft. No answer. Because she’s right.\nINT. MYCROFT’S STUDY - NIGHT\n145\n145\nMYCROFT at his desk. On the table in front of him, the\nleopard skin camera-phone. Opposite is IRENE. Standing with\nhis back to them both, SHERLOCK looking out into the night -\na brooding, silent presence.\nMycroft prods the phone with his finger.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n99.\n\n\nMYCROFT\nWe have people who can get into\nthis.\nIRENE ADLER\nI tested that theory for you - I\nlet Sherlock Holmes try for six\nmonths. Sherlock, dear, tell him\nwhat you found when you X-rayed my\ncamera-phone.\nSherlock doesn’t turn, just speaks from where he’s standing.\nSHERLOCK\nThere are four additional units\nwired into the casing - I suspect\ncontaining acid or a small amount\nof explosive. Any attempt to open\nthe casing, will burn the hard\ndrive.\nIRENE ADLER\nExplosive. It’s more me.\nMYCROFT\nSome data is always recoverable.\nIRENE ADLER\nTake that risk then.\nMYCROFT\n... you have a passcode to open\nthis. I deeply regret to say, we\nhave people who can extract it from\nyou.\nIRENE ADLER\nSherlock?\n*\nSHERLOCK\nThere will be two codes. One to\nopen the phone, one to burn the\ndrive. Even under duress, you can’t\nknow which one she’s given you. And\nthere would be no point in a second\nattempt.\nIRENE ADLER\nOh, isn’t he good. I should have\nhim on a leash. In fact, I might.\nMYCROFT\nWe destroy this then. No one has\nthe information.\nIRENE ADLER\nFine, good idea. Unless there are\nlives of British citizens depending\non the information you’re about to\nburn.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n100.\n\n\nMYCROFT\nAre there?\nIRENE ADLER\nTelling you, would be playing fair.\nI’m not playing any more.\nShe’s tossed him an envelope across the desk to Mycroft.\nIRENE ADLER\nA list of requests, and some ideas\nabout my protection once they’re\ngranted.\nMycroft has slit open the envelope, glanced at the single\nsheet.\nIRENE ADLER\nI’d say it wouldn’t blow much of a\nhole in the wealth of a nation, but\nI’d be lying. I imagine you’d like\nto sleep on it.\nMYCROFT\nThank you, yes.\nIRENE ADLER\nToo bad. Off you pop and talk to\npeople.\nHe looks at her. A grim moment - total defeat. A polite\nlittle bow of his head.\nMYCROFT\nYou’ve been very ... thorough.  I\nwish our lot were half as good as\nyou.\nIRENE ADLER\nCan’t take all the credit. Got a\nbit of help. Jim Moriarty sends his\nlove.\nOn Sherlock’s back - stiffening.\nOn Mycroft, a sober note.\nMYCROFT\nYes, he’s been in touch. He seems\nto be desperate for my attention.\n(Makes a note)\nWhich I’m sure can be arranged.\nIRENE ADLER\nI had all this stuff, never really\nknew what to do with it. Thank God,\nfor the consultant criminal.\nGave me lots of advice on how to\nplay the Holmes boys. Do you know\nwhat he calls you - the Ice Man.\nAnd the Virgin.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n101.\n\n\nOn Sherlock again. Still not turning, still not rising to it.\nIRENE ADLER\nDidn’t even ask for anything. I\nthink he just likes to cause\ntrouble. Now that’s my kind of man.\nMYCROFT\nAnd here you are. The dominatrix\nwho brought a nation to its knees.\nNicely played.\nHe starts to stand, but -\nSHERLOCK\n(Still without turning)\nNo.\nIRENE ADLER\nI’m sorry?\nSherlock, turning now. Quite his old self, cold as ice.\nSHERLOCK\nI said, no. Very, very close, but\nno. You got carried away, the game\nwas far too elaborate - you enjoyed\nyourself too much.\nIRENE ADLER\nThere’s no such thing as too much.\nSHERLOCK\nEnjoying thrill of the chase is\nfine. Craving the distraction of\nthe game - I entirely sympathise.\nBut sentiment? Sentiment is a\nchemical defect found in the losing\nside.\nIRENE ADLER\nSentiment? What are you talking\nabout?\nSHERLOCK\nYou.\nIRENE ADLER\nOh dear God, look at the poor man.\nYou don’t think I was actually\ninterested in you? Why? Because\nyou’re the great Sherlock Holmes?\nThe clever detective with the funny\nhat?\nSHERLOCK\nNo. Because I took your pulse.\nFLASHBACK: in 221B, Irene taking Sherlock’s hand, Sherlock\nclumsily reciprocating - but actually taking her pulse.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n102.\n\n\nSHERLOCK\nElevated. Your pupils dilated.\nFLASHBACK: Irene studying his face hungrily. Sherlock\nstaring, back forensic. Closer now on her dilating pupil.\nSHERLOCK\nI imagine John Watson thinks love\nis a mystery to me. But the\nchemistry is terribly simple. And\nvery destructive.\nHe’s walking round the desk - in swanning about, explaining\nmode. He picks up her camera-phone.\nOn Irene - just the first uncertainty. Is she in trouble now?\nSHERLOCK\nYou told me, when we first met,\nthat disguise is always a self-\nportrait. How true of you. The\ncombination of your safe - your\nmeasurements. But this -\n(Tosses the camera-phone\nin his hand)\nThis is more intimate. It’s your\nheart. And you should never let it\nrule your head.\n(Presses one key. A beep)\nYou could have chosen any random\nnumber and you’d have walked away\ntoday, with everything you worked\nfor.\n(Another key - beep)\nBut you couldn’t resist it, could\nyou? I’ve always assumed that love\nwas a dangerous disadvantage -\n(Beep)\nThank you for the final proof.\nHe holds the phone out to her, displaying the screen.\nIrene, rocked already, just stares at it. Everything is lost.\nMaybe there’s even a tear in her eye, as she looks up at him.\nIRENE ADLER\nEverything I said tonight - it\nwasn’t real. It was just playing\nthe game.\nSHERLOCK\nI know. And this is just losing.\nThe final beep. And now we see the fully entered code.\nLetters not numbers, and the screen now reads:\nI AM\n[S] [H] [E] [R]\nLOCKED\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n103.\n\n\nThe screen flashes, folds out into menu displays.\nSHERLOCK\nAnd so you are.\nHe tosses it to Mycroft.\nSHERLOCK\nThere you go, brother. I hope the\ncontents make up for any\ninconvenience I’ve caused you this\nevening.\nMycroft, bemusedly staring at the phone. He’s pleased at the\nvictory, but just a little chilled at how Sherlock won.\nMYCROFT\nI’m certain they will...\nSHERLOCK\nIf you’re feeling kind, lock her\nup. If not, let her go. I doubt\nshe’ll last long without her\nprotection.\nIRENE ADLER\nAre you expecting me to beg?\nSHERLOCK\nYes.\nHe turns, heading to the door, almost gets there -\nIRENE ADLER\nPlease.\nHe looks round. She’s standing now - so vulnerable. Pleading.\nIRENE ADLER\nYou’re right. I won’t last six\nmonths. Please.\nPushing in Sherlock now - that cold, cruel face.\nSHERLOCK\nSorry about dinner.\nAnd he goes, closing the door behind him. And slowly we fade\nto black.\n"
    },
    {
        "scene": "EXT. BAKER STREET - DAY146\n146\nIt’s winter again - and raining like hell: a day for terrible\nnews. JOHN is dashing along through the downpour. He stops as\nhe sees an unfamiliar sight.\nMYCROFT, leaning against the wall, outside Speedy’s. He’s\nunder shelter of the awning and smoking. He has big ziplock\nfile under his arm. John approaches.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n104.\n\n\nJOHN\nYou don’t smoke.\nMYCROFT\nI also don’t frequent cafes.\nHe turns and heads into Speedy’s, clearly expecting John to\nfollow.\nINT. SPEEDY’S CAFE - DAY\n147\n147\nMYCROFT and JOHN, sitting across the table from each other,\nwith coffees. Silence for a moment - just the hiss of the\nrain outside, the under-sea gloom of the cafe, the soaking\nwet coats of the customers.\nJohn’s eyes go to:\nThe zip-lock file on the table. Through the transparent cover\nhe can see a sheaf of papers, and the leopard skin camera-\nphone.\nJOHN\nThe file on Irene Adler.\nMYCROFT\nClosed for ever. I’m about to go\nand inform my brother - or, if you\nprefer, you are - that she somehow\ngot herself into a witness\nprotection scheme in America. New\nname, new identity. She will\nsurvive and thrive - but he will\nnever see her again.\nJOHN\nWhy would he care?\nMycroft just looks at him. Oh, come now.\nJOHN\nHe despised her at the end. He\nwon’t even mention her by name -\njust “the woman.”\nMYCROFT\nIs that loathing, or a salute? One\nof a kind, the one woman who\nmatters?\nJOHN\nHe’s not like that. He doesn’t feel\nthings that way. I don’t think ...\nMYCROFT\nMy brother has the brain of\nscientist, or a philosopher. Yet he\nelects to be a detective. What\nmight we deduce about his heart?\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n105.\n\n\nJOHN\nI don’t know.\nMYCROFT\nNeither do I. But initially he\nwanted to be a pirate.\nJOHN\nHe’ll be okay with this. Witness\nprotection, never seeing her again,\nhe’ll be fine.\nMYCROFT\nI agree. That’s why I decided to\ntell him that.\nJohn looks at Mycroft. Something new in the room now. What\ndoes he mean?\nJOHN\n... instead of what?\nMYCROFT\nShe’s dead. She was captured by a\nterrorist cell in Islamabad two\nmonths ago, and beheaded.\nA silence between them. Oh.\nJOHN\nDefinitely her? She’s done this\nbefore...\nMYCROFT\nI was thorough this time. It would\ntake Sherlock Holmes to fool me,\nand I don’t think he was on hand,\ndo you?\nAnother silence. Oh God.\nMYCROFT\nSo.\n(Pushes the file over to\nJohn)\nWhat shall we tell Sherlock?\nINT. 221B BAKER STREET - DAY\n148\n148\nSHERLOCK at the kitchen table. He’s at his microscope\nstudying something.\nOn John. He’s hesitating a few feet away. He has the file in\nhis hand.\nThe rain is streaming down the windows, casting shadow-\npatterns all over the walls. The little flat has never looked\nso gloomy.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n106.\n\n\nSHERLOCK\n(Without looking up)\nClearly you have news. If it’s\nabout that triple murder in Leeds,\nit was the gardener. Did nobody\nnotice his earring?\nJOHN\nHi. No, it’s ... it’s about Irene\nAdler.\nAnd Sherlock looks up, instantly interested.\nOn John, registering this.\nSHERLOCK\nWell? Has something happened? Has\nshe turned up again?\nJOHN\nNo. No, she’s ... I just bumped\ninto Mycroft downstairs, he had to\ntake a call ...\nSHERLOCK\nIs she back in London?\nAnd he’s on his feet. He’s come over to John. He’s just that\nlittle bit too interested.\nJOHN\nNo. She’s ...\nAnd he’s looking hard at Sherlock. And Sherlock is looking a\nbit too hard at him. And John makes the fateful decision.\nJOHN\nShe’s in America.\nSHERLOCK\nAmerica?\nJOHN\nYeah. She’s gone into a witness\nprotection scheme, apparently.\nDon’t know how she swung it. But,\nyou know ...\nSHERLOCK\nI know what?\nJOHN\nWell. You won’t able to see her\nagain.\nSHERLOCK\nWhy would I want to see her again?\nJOHN\nDidn’t say you did.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n107.\n\n\nSHERLOCK\nIs that her file?\nJOHN\nYeah - got to take it back to\nMycroft. Do you ... want a look at\nit?\nSHERLOCK\nNo.\nSherlock has gone back to his microscope.\nOh John: has he misjudged. Should he have told him,\nJOHN\nListen. Actually -\nSHERLOCK\n(Without looking up)\nOh, but I’ll have the camera-phone.\nHe puts his hand out for it.\nJOHN\nThere’s nothing on it any more. It\nwas all stripped off.\nSHERLOCK\nI know. But I’ll have it.\nJOHN\nNo, it has to go back to Mycroft.\nYou can’t keep this.\nSherlock doesn’t reply, or even look at him. Just continues\nto hold his hand out.\nJOHN\nSherlock, I have to take this back.\nIt’s government property now, it’s -\nSHERLOCK\nPlease.\nStill hasn’t looked round, still hasn’t registered any\nemotion.\nJohn: what the hell does he do. He steps over, hands him the\ncamera-phone. Sherlock pockets it.\nSHERLOCK\nThank you.\nJohn, now hesitating to the door.\nJOHN\nBetter take this back down.\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n108.\n\n\nSHERLOCK\nYes.\nJohn, at the door, turns.\nJOHN\nDid she ever text you again? After\n... all that?\nSHERLOCK\nOnce. A couple of months ago.\nJOHN\nWhat did she say?\nSHERLOCK\nGoodbye, Mr. Holmes.\nOn John. Considers that for a moment - probably the last day\nof her life. He heads out.\nWe stay on Sherlock. Sits back from the microscope. Then\nstands, crossing to the window. He’s got his phone out, is\nscrolling through some old texts.\nCloser on the phone. Under the heading The Woman, all her\ntexts. The last one\nGOOD-BYE MR. HOLMES.\nOn this we dissolve to:\nINT. GROTTY LITTLE ROOM/ISLAMABAD - DAY\n149\n149\nIRENE, on her last day, kneeling in the centre of a room,\nsurrounded by MASKED AND ROBED TERRORISTS.\nIrene is calm, serene - and sending one last text. She now\nhands her phone to one of the terrorists, and we see her say\n“Thankyou”. Her EXECUTIONER is stepping up behind her now,\nswinging back with his long sword.\nCloser on Irene now, as she straightens her neck and prepares\nherself for the end. So sad, so full of regrets. She slowly\ncloses her eyes.\nAnd as her eyes close, the screen fades into darkness.\nWe hold the darkness for a long final moment, like the movie\nreally is over. Then:\nAn ORGASMIC GASP. A text has arrived!\nOn Irene as her eyes fly open again. What? Where did that\ncome from??\nThe terrorists all looking at each other now. What??\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n109.\n\n\nBut Irene is looking up at her tall, thin executioner. The\nface is covered but the voice is familiar.\nSHERLOCK\nWhen I say run, run!\nOn Irene - her face breaks into a delighted, incredulous\ngrin.\nINT. 221B BAKER STREET - DAY\n150\n150\nAnd now the same grin on Sherlock’s face, remembering that\nday. He laughs! Fooled them all again! He pulls the leopard\nskin camera-phone from his pocket, tosses it in his hand.\nSHERLOCK\n(As a sort of salute)\nThe Woman!\nHe takes the camera-phone, opens his desk drawer, drops it\ninside. Looks at it lying there for moment.\nSHERLOCK\n(More fondly)\nThe Woman.\nOn his face, clear moment of warmth - remembering the long\ncontest, that remarkable woman, the year of Irene Adler.\nThen he closes the drawer. It’s almost ceremonial - like he’s\nputting something away. Then the warmth just drops from his\nface, and he’s Sherlock Holmes again.\nWe hold the closed drawer big in the foreground as he turns\nand walks away - back to his microscope, back to work...\nEND CREDITS\nA Scandal in Belgravia - Pink Pages  - 25/07/2011\n110."
    }
]